/* automatically generated by rust-bindgen 0.59.2 */

#![allow(non_camel_case_types, non_upper_case_globals, non_snake_case)]
#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const DRBG_MAX_REQUESTS_PER_RESEED: u64 = 281474976710656;
pub const DRBG_MAX_REQEST_SIZE: u64 = 4294967296;
pub const CTR_DRBG_MAX_BYTES_PER_REQUEST: u32 = 65536;
pub const TESTING: u32 = 1;
pub const ENTROPY: u32 = 2;
pub const TESTED: u32 = 4;
pub const FATAL_ERROR_ALLOCATION: u32 = 1;
pub const FATAL_ERROR_DIVIDE_ZERO: u32 = 2;
pub const FATAL_ERROR_INTERNAL: u32 = 3;
pub const FATAL_ERROR_PARAMETER: u32 = 4;
pub const FATAL_ERROR_ENTROPY: u32 = 5;
pub const FATAL_ERROR_SELF_TEST: u32 = 6;
pub const FATAL_ERROR_CRYPTO: u32 = 7;
pub const FATAL_ERROR_NV_UNRECOVERABLE: u32 = 8;
pub const FATAL_ERROR_REMANUFACTURED: u32 = 9;
pub const FATAL_ERROR_DRBG: u32 = 10;
pub const FATAL_ERROR_MOVE_SIZE: u32 = 11;
pub const FATAL_ERROR_COUNTER_OVERFLOW: u32 = 12;
pub const FATAL_ERROR_SUBTRACT: u32 = 13;
pub const FATAL_ERROR_MATHLIBRARY: u32 = 14;
pub const FATAL_ERROR_FORCED: u32 = 666;
pub const NV_RAM_REF_INIT: u32 = 0;
pub const RH_ACT_2: u32 = 0;
pub const RH_ACT_3: u32 = 0;
pub const RH_ACT_4: u32 = 0;
pub const RH_ACT_5: u32 = 0;
pub const RH_ACT_6: u32 = 0;
pub const RH_ACT_7: u32 = 0;
pub const RH_ACT_8: u32 = 0;
pub const RH_ACT_9: u32 = 0;
pub const RH_ACT_B: u32 = 0;
pub const RH_ACT_C: u32 = 0;
pub const RH_ACT_D: u32 = 0;
pub const RH_ACT_E: u32 = 0;
pub const RH_ACT_F: u32 = 0;
pub const RSA_prime_flag: u32 = 32768;
pub const EXPIRES_ON_RESET: i32 = -2147483648;
pub const EXPIRES_ON_RESTART: i32 = -2147483647;
pub const SU_NONE_VALUE: u32 = 65535;
pub const SU_DA_USED_VALUE: u32 = 65534;
pub const PRE_STARTUP_FLAG: u32 = 32768;
pub const STARTUP_LOCALITY_3: u32 = 16384;
pub const NV_PERSISTENT_DATA: u32 = 0;
pub const NV_USER_DYNAMIC_END: u32 = 16384;
pub type __u_char = crate::cty::c_uchar;
pub type __u_short = crate::cty::c_ushort;
pub type __u_int = crate::cty::c_uint;
pub type __u_long = crate::cty::c_ulong;
pub type __int8_t = crate::cty::c_schar;
pub type __uint8_t = crate::cty::c_uchar;
pub type __int16_t = crate::cty::c_short;
pub type __uint16_t = crate::cty::c_ushort;
pub type __int32_t = crate::cty::c_int;
pub type __uint32_t = crate::cty::c_uint;
pub type __int64_t = crate::cty::c_long;
pub type __uint64_t = crate::cty::c_ulong;
pub type __quad_t = crate::cty::c_long;
pub type __u_quad_t = crate::cty::c_ulong;
pub type __intmax_t = crate::cty::c_long;
pub type __uintmax_t = crate::cty::c_ulong;
pub type __dev_t = crate::cty::c_ulong;
pub type __uid_t = crate::cty::c_uint;
pub type __gid_t = crate::cty::c_uint;
pub type __ino_t = crate::cty::c_ulong;
pub type __ino64_t = crate::cty::c_ulong;
pub type __mode_t = crate::cty::c_uint;
pub type __nlink_t = crate::cty::c_ulong;
pub type __off_t = crate::cty::c_long;
pub type __off64_t = crate::cty::c_long;
pub type __pid_t = crate::cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [crate::cty::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = crate::cty::c_long;
pub type __rlim_t = crate::cty::c_ulong;
pub type __rlim64_t = crate::cty::c_ulong;
pub type __id_t = crate::cty::c_uint;
pub type __time_t = crate::cty::c_long;
pub type __useconds_t = crate::cty::c_uint;
pub type __suseconds_t = crate::cty::c_long;
pub type __daddr_t = crate::cty::c_int;
pub type __key_t = crate::cty::c_int;
pub type __clockid_t = crate::cty::c_int;
pub type __timer_t = *mut crate::cty::c_void;
pub type __blksize_t = crate::cty::c_long;
pub type __blkcnt_t = crate::cty::c_long;
pub type __blkcnt64_t = crate::cty::c_long;
pub type __fsblkcnt_t = crate::cty::c_ulong;
pub type __fsblkcnt64_t = crate::cty::c_ulong;
pub type __fsfilcnt_t = crate::cty::c_ulong;
pub type __fsfilcnt64_t = crate::cty::c_ulong;
pub type __fsword_t = crate::cty::c_long;
pub type __ssize_t = crate::cty::c_long;
pub type __syscall_slong_t = crate::cty::c_long;
pub type __syscall_ulong_t = crate::cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut crate::cty::c_char;
pub type __intptr_t = crate::cty::c_long;
pub type __socklen_t = crate::cty::c_uint;
pub type __sig_atomic_t = crate::cty::c_int;
pub type int_least8_t = crate::cty::c_schar;
pub type int_least16_t = crate::cty::c_short;
pub type int_least32_t = crate::cty::c_int;
pub type int_least64_t = crate::cty::c_long;
pub type uint_least8_t = crate::cty::c_uchar;
pub type uint_least16_t = crate::cty::c_ushort;
pub type uint_least32_t = crate::cty::c_uint;
pub type uint_least64_t = crate::cty::c_ulong;
pub type int_fast8_t = crate::cty::c_schar;
pub type int_fast16_t = crate::cty::c_long;
pub type int_fast32_t = crate::cty::c_long;
pub type int_fast64_t = crate::cty::c_long;
pub type uint_fast8_t = crate::cty::c_uchar;
pub type uint_fast16_t = crate::cty::c_ulong;
pub type uint_fast32_t = crate::cty::c_ulong;
pub type uint_fast64_t = crate::cty::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type UINT8 = u8;
pub type BYTE = u8;
pub type INT8 = i8;
pub type BOOL = crate::cty::c_int;
pub type UINT16 = u16;
pub type INT16 = i16;
pub type UINT32 = u32;
pub type INT32 = i32;
pub type UINT64 = u64;
pub type INT64 = i64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TPM2B {
    pub size: UINT16,
    pub buffer: [BYTE; 1usize],
}
#[test]
fn bindgen_test_layout_TPM2B() {
    assert_eq!(
        ::core::mem::size_of::<TPM2B>(),
        4usize,
        concat!("Size of: ", stringify!(TPM2B))
    );
    assert_eq!(
        ::core::mem::align_of::<TPM2B>(),
        2usize,
        concat!("Alignment of ", stringify!(TPM2B))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPM2B>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPM2B>())).buffer as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B),
            "::",
            stringify!(buffer)
        )
    );
}
pub type P2B = *mut TPM2B;
pub type PC2B = *const TPM2B;
#[repr(C)]
#[derive(Copy, Clone)]
pub union TPM2B_MAX_HASH_BLOCK {
    pub t: TPM2B_MAX_HASH_BLOCK__bindgen_ty_1,
    pub b: TPM2B,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TPM2B_MAX_HASH_BLOCK__bindgen_ty_1 {
    pub size: UINT16,
    pub buffer: [BYTE; 128usize],
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_HASH_BLOCK__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>(),
        130usize,
        concat!("Size of: ", stringify!(TPM2B_MAX_HASH_BLOCK__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(TPM2B_MAX_HASH_BLOCK__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>())).size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B_MAX_HASH_BLOCK__bindgen_ty_1),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TPM2B_MAX_HASH_BLOCK__bindgen_ty_1>())).buffer as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B_MAX_HASH_BLOCK__bindgen_ty_1),
            "::",
            stringify!(buffer)
        )
    );
}
#[test]
fn bindgen_test_layout_TPM2B_MAX_HASH_BLOCK() {
    assert_eq!(
        ::core::mem::size_of::<TPM2B_MAX_HASH_BLOCK>(),
        130usize,
        concat!("Size of: ", stringify!(TPM2B_MAX_HASH_BLOCK))
    );
    assert_eq!(
        ::core::mem::align_of::<TPM2B_MAX_HASH_BLOCK>(),
        2usize,
        concat!("Alignment of ", stringify!(TPM2B_MAX_HASH_BLOCK))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPM2B_MAX_HASH_BLOCK>())).t as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B_MAX_HASH_BLOCK),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPM2B_MAX_HASH_BLOCK>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPM2B_MAX_HASH_BLOCK),
            "::",
            stringify!(b)
        )
    );
}
pub type TPM2B_HASH_BLOCK = TPM2B_MAX_HASH_BLOCK;
pub type size_t = crate::cty::c_ulong;
pub type wchar_t = crate::cty::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: crate::cty::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aes_key_st {
    pub rd_key: [crate::cty::c_uint; 60usize],
    pub rounds: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_aes_key_st() {
    assert_eq!(
        ::core::mem::size_of::<aes_key_st>(),
        244usize,
        concat!("Size of: ", stringify!(aes_key_st))
    );
    assert_eq!(
        ::core::mem::align_of::<aes_key_st>(),
        4usize,
        concat!("Alignment of ", stringify!(aes_key_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<aes_key_st>())).rd_key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aes_key_st),
            "::",
            stringify!(rd_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<aes_key_st>())).rounds as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(aes_key_st),
            "::",
            stringify!(rounds)
        )
    );
}
pub type AES_KEY = aes_key_st;
extern "C" {
    pub fn AES_options() -> *const crate::cty::c_char;
}
extern "C" {
    pub fn AES_set_encrypt_key(
        userKey: *const crate::cty::c_uchar,
        bits: crate::cty::c_int,
        key: *mut AES_KEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn AES_set_decrypt_key(
        userKey: *const crate::cty::c_uchar,
        bits: crate::cty::c_int,
        key: *mut AES_KEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn AES_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const AES_KEY,
    );
}
extern "C" {
    pub fn AES_decrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const AES_KEY,
    );
}
extern "C" {
    pub fn AES_ecb_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const AES_KEY,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_cbc_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_cfb128_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_cfb1_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_cfb8_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_ofb128_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_ige_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        ivec: *mut crate::cty::c_uchar,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_bi_ige_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const AES_KEY,
        key2: *const AES_KEY,
        ivec: *const crate::cty::c_uchar,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn AES_wrap_key(
        key: *mut AES_KEY,
        iv: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        in_: *const crate::cty::c_uchar,
        inlen: crate::cty::c_uint,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn AES_unwrap_key(
        key: *mut AES_KEY,
        iv: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        in_: *const crate::cty::c_uchar,
        inlen: crate::cty::c_uint,
    ) -> crate::cty::c_int;
}
pub type KEY_TABLE_TYPE = [crate::cty::c_uint; 68usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub struct camellia_key_st {
    pub u: camellia_key_st__bindgen_ty_1,
    pub grand_rounds: crate::cty::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union camellia_key_st__bindgen_ty_1 {
    pub d: f64,
    pub rd_key: KEY_TABLE_TYPE,
}
#[test]
fn bindgen_test_layout_camellia_key_st__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<camellia_key_st__bindgen_ty_1>(),
        272usize,
        concat!("Size of: ", stringify!(camellia_key_st__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<camellia_key_st__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(camellia_key_st__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<camellia_key_st__bindgen_ty_1>())).d as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(camellia_key_st__bindgen_ty_1),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<camellia_key_st__bindgen_ty_1>())).rd_key as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(camellia_key_st__bindgen_ty_1),
            "::",
            stringify!(rd_key)
        )
    );
}
#[test]
fn bindgen_test_layout_camellia_key_st() {
    assert_eq!(
        ::core::mem::size_of::<camellia_key_st>(),
        280usize,
        concat!("Size of: ", stringify!(camellia_key_st))
    );
    assert_eq!(
        ::core::mem::align_of::<camellia_key_st>(),
        8usize,
        concat!("Alignment of ", stringify!(camellia_key_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<camellia_key_st>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(camellia_key_st),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<camellia_key_st>())).grand_rounds as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(camellia_key_st),
            "::",
            stringify!(grand_rounds)
        )
    );
}
pub type CAMELLIA_KEY = camellia_key_st;
extern "C" {
    pub fn Camellia_set_key(
        userKey: *const crate::cty::c_uchar,
        bits: crate::cty::c_int,
        key: *mut CAMELLIA_KEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn Camellia_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const CAMELLIA_KEY,
    );
}
extern "C" {
    pub fn Camellia_decrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const CAMELLIA_KEY,
    );
}
extern "C" {
    pub fn Camellia_ecb_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        key: *const CAMELLIA_KEY,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_cbc_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_cfb128_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_cfb1_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_cfb8_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
        enc: crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_ofb128_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_int,
    );
}
extern "C" {
    pub fn Camellia_ctr128_encrypt(
        in_: *const crate::cty::c_uchar,
        out: *mut crate::cty::c_uchar,
        length: size_t,
        key: *const CAMELLIA_KEY,
        ivec: *mut crate::cty::c_uchar,
        ecount_buf: *mut crate::cty::c_uchar,
        num: *mut crate::cty::c_uint,
    );
}
pub type __gwchar_t = crate::cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: crate::cty::c_long,
    pub rem: crate::cty::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: crate::cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: crate::cty::c_int,
    ) -> uintmax_t;
}
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: crate::cty::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: crate::cty::c_uint,
    pub __wchb: [crate::cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = crate::cty::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::core::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = crate::cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: crate::cty::c_int,
    pub _IO_read_ptr: *mut crate::cty::c_char,
    pub _IO_read_end: *mut crate::cty::c_char,
    pub _IO_read_base: *mut crate::cty::c_char,
    pub _IO_write_base: *mut crate::cty::c_char,
    pub _IO_write_ptr: *mut crate::cty::c_char,
    pub _IO_write_end: *mut crate::cty::c_char,
    pub _IO_buf_base: *mut crate::cty::c_char,
    pub _IO_buf_end: *mut crate::cty::c_char,
    pub _IO_save_base: *mut crate::cty::c_char,
    pub _IO_backup_base: *mut crate::cty::c_char,
    pub _IO_save_end: *mut crate::cty::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: crate::cty::c_int,
    pub _flags2: crate::cty::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: crate::cty::c_ushort,
    pub _vtable_offset: crate::cty::c_schar,
    pub _shortbuf: [crate::cty::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut crate::cty::c_void,
    pub __pad2: *mut crate::cty::c_void,
    pub __pad3: *mut crate::cty::c_void,
    pub __pad4: *mut crate::cty::c_void,
    pub __pad5: size_t,
    pub _mode: crate::cty::c_int,
    pub _unused2: [crate::cty::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut crate::cty::c_void,
        __buf: *mut crate::cty::c_char,
        __nbytes: size_t,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut crate::cty::c_void,
        __buf: *const crate::cty::c_char,
        __n: size_t,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut crate::cty::c_void,
        __pos: *mut __off64_t,
        __w: crate::cty::c_int,
    ) -> crate::cty::c_int,
>;
pub type __io_close_fn = ::core::option::Option<
    unsafe extern "C" fn(__cookie: *mut crate::cty::c_void) -> crate::cty::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: crate::cty::c_int, __fp: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const crate::cty::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const crate::cty::c_char,
        arg3: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: crate::cty::c_int, arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut crate::cty::c_void, arg3: size_t) -> size_t;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: crate::cty::c_int,
        arg4: crate::cty::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t, arg3: crate::cty::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type fpos_t = _G_fpos_t;
extern "C" {
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const crate::cty::c_char,
        __new: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut crate::cty::c_char) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const crate::cty::c_char,
        __modes: *const crate::cty::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const crate::cty::c_char,
        __modes: *const crate::cty::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut crate::cty::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut crate::cty::c_char,
        __modes: crate::cty::c_int,
        __n: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn printf(__format: *const crate::cty::c_char, ...) -> crate::cty::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut crate::cty::c_char,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut crate::cty::c_char,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut crate::cty::c_char,
        __maxlen: crate::cty::c_ulong,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut crate::cty::c_char,
        __maxlen: crate::cty::c_ulong,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn scanf(__format: *const crate::cty::c_char, ...) -> crate::cty::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const crate::cty::c_char,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const crate::cty::c_char, ...) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const crate::cty::c_char,
        __format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const crate::cty::c_char,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const crate::cty::c_char,
        __format: *const crate::cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn getchar() -> crate::cty::c_int;
}
extern "C" {
    pub fn fputc(__c: crate::cty::c_int, __stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn putc(__c: crate::cty::c_int, __stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn putchar(__c: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut crate::cty::c_char,
        __n: crate::cty::c_int,
        __stream: *mut FILE,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn fputs(__s: *const crate::cty::c_char, __stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn puts(__s: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn ungetc(__c: crate::cty::c_int, __stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut crate::cty::c_void,
        __size: crate::cty::c_ulong,
        __n: crate::cty::c_ulong,
        __stream: *mut FILE,
    ) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const crate::cty::c_void,
        __size: crate::cty::c_ulong,
        __n: crate::cty::c_ulong,
        __s: *mut FILE,
    ) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: crate::cty::c_long,
        __whence: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> crate::cty::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> crate::cty::c_int;
}
extern "C" {
    pub fn perror(__s: *const crate::cty::c_char);
}
pub type ASN1_INTEGER = asn1_string_st;
pub type ASN1_ENUMERATED = asn1_string_st;
pub type ASN1_BIT_STRING = asn1_string_st;
pub type ASN1_OCTET_STRING = asn1_string_st;
pub type ASN1_PRINTABLESTRING = asn1_string_st;
pub type ASN1_T61STRING = asn1_string_st;
pub type ASN1_IA5STRING = asn1_string_st;
pub type ASN1_GENERALSTRING = asn1_string_st;
pub type ASN1_UNIVERSALSTRING = asn1_string_st;
pub type ASN1_BMPSTRING = asn1_string_st;
pub type ASN1_UTCTIME = asn1_string_st;
pub type ASN1_TIME = asn1_string_st;
pub type ASN1_GENERALIZEDTIME = asn1_string_st;
pub type ASN1_VISIBLESTRING = asn1_string_st;
pub type ASN1_UTF8STRING = asn1_string_st;
pub type ASN1_STRING = asn1_string_st;
pub type ASN1_BOOLEAN = crate::cty::c_int;
pub type ASN1_NULL = crate::cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_object_st {
    _unused: [u8; 0],
}
pub type ASN1_OBJECT = asn1_object_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ITEM_st {
    _unused: [u8; 0],
}
pub type ASN1_ITEM = ASN1_ITEM_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_pctx_st {
    _unused: [u8; 0],
}
pub type ASN1_PCTX = asn1_pctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_sctx_st {
    _unused: [u8; 0],
}
pub type ASN1_SCTX = asn1_sctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dane_st {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_st {
    _unused: [u8; 0],
}
pub type BIO = bio_st;
pub type BIGNUM = bignum_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bignum_ctx {
    _unused: [u8; 0],
}
pub type BN_CTX = bignum_ctx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_blinding_st {
    _unused: [u8; 0],
}
pub type BN_BLINDING = bn_blinding_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_mont_ctx_st {
    _unused: [u8; 0],
}
pub type BN_MONT_CTX = bn_mont_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_recp_ctx_st {
    _unused: [u8; 0],
}
pub type BN_RECP_CTX = bn_recp_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_gencb_st {
    _unused: [u8; 0],
}
pub type BN_GENCB = bn_gencb_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct buf_mem_st {
    _unused: [u8; 0],
}
pub type BUF_MEM = buf_mem_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_st {
    _unused: [u8; 0],
}
pub type EVP_CIPHER = evp_cipher_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_CIPHER_CTX = evp_cipher_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_md_st {
    _unused: [u8; 0],
}
pub type EVP_MD = evp_md_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_md_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_MD_CTX = evp_md_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY = evp_pkey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_asn1_method_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_ASN1_METHOD = evp_pkey_asn1_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_method_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_METHOD = evp_pkey_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_CTX = evp_pkey_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_Encode_Ctx_st {
    _unused: [u8; 0],
}
pub type EVP_ENCODE_CTX = evp_Encode_Ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hmac_ctx_st {
    _unused: [u8; 0],
}
pub type HMAC_CTX = hmac_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dh_st {
    _unused: [u8; 0],
}
pub type DH = dh_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dh_method {
    _unused: [u8; 0],
}
pub type DH_METHOD = dh_method;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsa_st {
    _unused: [u8; 0],
}
pub type DSA = dsa_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsa_method {
    _unused: [u8; 0],
}
pub type DSA_METHOD = dsa_method;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_st {
    _unused: [u8; 0],
}
pub type RSA = rsa_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_meth_st {
    _unused: [u8; 0],
}
pub type RSA_METHOD = rsa_meth_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_key_st {
    _unused: [u8; 0],
}
pub type EC_KEY = ec_key_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_key_method_st {
    _unused: [u8; 0],
}
pub type EC_KEY_METHOD = ec_key_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rand_meth_st {
    _unused: [u8; 0],
}
pub type RAND_METHOD = rand_meth_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rand_drbg_st {
    _unused: [u8; 0],
}
pub type RAND_DRBG = rand_drbg_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_dane_st {
    _unused: [u8; 0],
}
pub type SSL_DANE = ssl_dane_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_st {
    _unused: [u8; 0],
}
pub type X509 = x509_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_algor_st {
    _unused: [u8; 0],
}
pub type X509_ALGOR = X509_algor_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_crl_st {
    _unused: [u8; 0],
}
pub type X509_CRL = X509_crl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_crl_method_st {
    _unused: [u8; 0],
}
pub type X509_CRL_METHOD = x509_crl_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_revoked_st {
    _unused: [u8; 0],
}
pub type X509_REVOKED = x509_revoked_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_name_st {
    _unused: [u8; 0],
}
pub type X509_NAME = X509_name_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_pubkey_st {
    _unused: [u8; 0],
}
pub type X509_PUBKEY = X509_pubkey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_st {
    _unused: [u8; 0],
}
pub type X509_STORE = x509_store_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_ctx_st {
    _unused: [u8; 0],
}
pub type X509_STORE_CTX = x509_store_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_object_st {
    _unused: [u8; 0],
}
pub type X509_OBJECT = x509_object_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP = x509_lookup_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_method_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP_METHOD = x509_lookup_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_VERIFY_PARAM_st {
    _unused: [u8; 0],
}
pub type X509_VERIFY_PARAM = X509_VERIFY_PARAM_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_sig_info_st {
    _unused: [u8; 0],
}
pub type X509_SIG_INFO = x509_sig_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pkcs8_priv_key_info_st {
    _unused: [u8; 0],
}
pub type PKCS8_PRIV_KEY_INFO = pkcs8_priv_key_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v3_ext_ctx {
    _unused: [u8; 0],
}
pub type X509V3_CTX = v3_ext_ctx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct conf_st {
    _unused: [u8; 0],
}
pub type CONF = conf_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_init_settings_st {
    _unused: [u8; 0],
}
pub type OPENSSL_INIT_SETTINGS = ossl_init_settings_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ui_st {
    _unused: [u8; 0],
}
pub type UI = ui_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ui_method_st {
    _unused: [u8; 0],
}
pub type UI_METHOD = ui_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct engine_st {
    _unused: [u8; 0],
}
pub type ENGINE = engine_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_st {
    _unused: [u8; 0],
}
pub type SSL = ssl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_ctx_st {
    _unused: [u8; 0],
}
pub type SSL_CTX = ssl_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct comp_ctx_st {
    _unused: [u8; 0],
}
pub type COMP_CTX = comp_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct comp_method_st {
    _unused: [u8; 0],
}
pub type COMP_METHOD = comp_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_NODE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_NODE = X509_POLICY_NODE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_LEVEL_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_LEVEL = X509_POLICY_LEVEL_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_TREE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_TREE = X509_POLICY_TREE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_CACHE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_CACHE = X509_POLICY_CACHE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AUTHORITY_KEYID_st {
    _unused: [u8; 0],
}
pub type AUTHORITY_KEYID = AUTHORITY_KEYID_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DIST_POINT_st {
    _unused: [u8; 0],
}
pub type DIST_POINT = DIST_POINT_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISSUING_DIST_POINT_st {
    _unused: [u8; 0],
}
pub type ISSUING_DIST_POINT = ISSUING_DIST_POINT_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NAME_CONSTRAINTS_st {
    _unused: [u8; 0],
}
pub type NAME_CONSTRAINTS = NAME_CONSTRAINTS_st;
pub type CRYPTO_EX_DATA = crypto_ex_data_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ocsp_req_ctx_st {
    _unused: [u8; 0],
}
pub type OCSP_REQ_CTX = ocsp_req_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ocsp_response_st {
    _unused: [u8; 0],
}
pub type OCSP_RESPONSE = ocsp_response_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ocsp_responder_id_st {
    _unused: [u8; 0],
}
pub type OCSP_RESPID = ocsp_responder_id_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sct_st {
    _unused: [u8; 0],
}
pub type SCT = sct_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sct_ctx_st {
    _unused: [u8; 0],
}
pub type SCT_CTX = sct_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ctlog_st {
    _unused: [u8; 0],
}
pub type CTLOG = ctlog_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ctlog_store_st {
    _unused: [u8; 0],
}
pub type CTLOG_STORE = ctlog_store_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ct_policy_eval_ctx_st {
    _unused: [u8; 0],
}
pub type CT_POLICY_EVAL_CTX = ct_policy_eval_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_store_info_st {
    _unused: [u8; 0],
}
pub type OSSL_STORE_INFO = ossl_store_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_store_search_st {
    _unused: [u8; 0],
}
pub type OSSL_STORE_SEARCH = ossl_store_search_st;
pub type ossl_intmax_t = intmax_t;
pub type ossl_uintmax_t = uintmax_t;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: crate::cty::c_int,
    pub rem: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: crate::cty::c_long,
    pub rem: crate::cty::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: crate::cty::c_longlong,
    pub rem: crate::cty::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const crate::cty::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const crate::cty::c_char) -> crate::cty::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const crate::cty::c_char) -> crate::cty::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const crate::cty::c_char, __endptr: *mut *mut crate::cty::c_char)
        -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const crate::cty::c_char, __endptr: *mut *mut crate::cty::c_char)
        -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> crate::cty::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> crate::cty::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const crate::cty::c_char,
        __endptr: *mut *mut crate::cty::c_char,
        __base: crate::cty::c_int,
    ) -> crate::cty::c_ulonglong;
}
extern "C" {
    pub fn rand() -> crate::cty::c_int;
}
extern "C" {
    pub fn srand(__seed: crate::cty::c_uint);
}
extern "C" {
    pub fn malloc(__size: crate::cty::c_ulong) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: crate::cty::c_ulong,
        __size: crate::cty::c_ulong,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut crate::cty::c_void,
        __size: crate::cty::c_ulong,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut crate::cty::c_void);
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> crate::cty::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn exit(__status: crate::cty::c_int);
}
extern "C" {
    pub fn quick_exit(__status: crate::cty::c_int);
}
extern "C" {
    pub fn _Exit(__status: crate::cty::c_int);
}
extern "C" {
    pub fn getenv(__name: *const crate::cty::c_char) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn system(__command: *const crate::cty::c_char) -> crate::cty::c_int;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const crate::cty::c_void,
        arg2: *const crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const crate::cty::c_void,
        __base: *const crate::cty::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut crate::cty::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn labs(__x: crate::cty::c_long) -> crate::cty::c_long;
}
extern "C" {
    pub fn llabs(__x: crate::cty::c_longlong) -> crate::cty::c_longlong;
}
extern "C" {
    pub fn div(__numer: crate::cty::c_int, __denom: crate::cty::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: crate::cty::c_long, __denom: crate::cty::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: crate::cty::c_longlong, __denom: crate::cty::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn mblen(__s: *const crate::cty::c_char, __n: size_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const crate::cty::c_char,
        __n: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut crate::cty::c_char, __wchar: wchar_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const crate::cty::c_char, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcstombs(__s: *mut crate::cty::c_char, __pwcs: *const wchar_t, __n: size_t) -> size_t;
}
pub type clock_t = __clock_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: crate::cty::c_int,
    pub tm_min: crate::cty::c_int,
    pub tm_hour: crate::cty::c_int,
    pub tm_mday: crate::cty::c_int,
    pub tm_mon: crate::cty::c_int,
    pub tm_year: crate::cty::c_int,
    pub tm_wday: crate::cty::c_int,
    pub tm_yday: crate::cty::c_int,
    pub tm_isdst: crate::cty::c_int,
    pub __tm_gmtoff: crate::cty::c_long,
    pub __tm_zone: *const crate::cty::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::core::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::core::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).__tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(__tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<tm>())).__tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(__tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut crate::cty::c_char,
        __maxsize: size_t,
        __format: *const crate::cty::c_char,
        __tp: *const tm,
    ) -> size_t;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut crate::cty::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut crate::cty::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: crate::cty::c_int;
}
extern "C" {
    pub static mut __timezone: crate::cty::c_long;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: crate::cty::c_int) -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st {
    _unused: [u8; 0],
}
pub type OPENSSL_STACK = stack_st;
pub type OPENSSL_sk_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const crate::cty::c_void,
        arg2: *const crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
pub type OPENSSL_sk_freefunc =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::cty::c_void)>;
pub type OPENSSL_sk_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const crate::cty::c_void) -> *mut crate::cty::c_void,
>;
extern "C" {
    pub fn OPENSSL_sk_num(arg1: *const OPENSSL_STACK) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_value(
        arg1: *const OPENSSL_STACK,
        arg2: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_set(
        st: *mut OPENSSL_STACK,
        i: crate::cty::c_int,
        data: *const crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_new(cmp: OPENSSL_sk_compfunc) -> *mut OPENSSL_STACK;
}
extern "C" {
    pub fn OPENSSL_sk_new_null() -> *mut OPENSSL_STACK;
}
extern "C" {
    pub fn OPENSSL_sk_new_reserve(
        c: OPENSSL_sk_compfunc,
        n: crate::cty::c_int,
    ) -> *mut OPENSSL_STACK;
}
extern "C" {
    pub fn OPENSSL_sk_reserve(st: *mut OPENSSL_STACK, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_free(arg1: *mut OPENSSL_STACK);
}
extern "C" {
    pub fn OPENSSL_sk_pop_free(
        st: *mut OPENSSL_STACK,
        func: ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::cty::c_void)>,
    );
}
extern "C" {
    pub fn OPENSSL_sk_deep_copy(
        arg1: *const OPENSSL_STACK,
        c: OPENSSL_sk_copyfunc,
        f: OPENSSL_sk_freefunc,
    ) -> *mut OPENSSL_STACK;
}
extern "C" {
    pub fn OPENSSL_sk_insert(
        sk: *mut OPENSSL_STACK,
        data: *const crate::cty::c_void,
        where_: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_delete(
        st: *mut OPENSSL_STACK,
        loc: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_delete_ptr(
        st: *mut OPENSSL_STACK,
        p: *const crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_find(
        st: *mut OPENSSL_STACK,
        data: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_find_ex(
        st: *mut OPENSSL_STACK,
        data: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_push(
        st: *mut OPENSSL_STACK,
        data: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_unshift(
        st: *mut OPENSSL_STACK,
        data: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_sk_shift(st: *mut OPENSSL_STACK) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_pop(st: *mut OPENSSL_STACK) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn OPENSSL_sk_zero(st: *mut OPENSSL_STACK);
}
extern "C" {
    pub fn OPENSSL_sk_set_cmp_func(
        sk: *mut OPENSSL_STACK,
        cmp: OPENSSL_sk_compfunc,
    ) -> OPENSSL_sk_compfunc;
}
extern "C" {
    pub fn OPENSSL_sk_dup(st: *const OPENSSL_STACK) -> *mut OPENSSL_STACK;
}
extern "C" {
    pub fn OPENSSL_sk_sort(st: *mut OPENSSL_STACK);
}
extern "C" {
    pub fn OPENSSL_sk_is_sorted(st: *const OPENSSL_STACK) -> crate::cty::c_int;
}
pub type OPENSSL_STRING = *mut crate::cty::c_char;
pub type OPENSSL_CSTRING = *const crate::cty::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_STRING {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_STRING_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const crate::cty::c_char,
        b: *const *const crate::cty::c_char,
    ) -> crate::cty::c_int,
>;
pub type sk_OPENSSL_STRING_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut crate::cty::c_char)>;
pub type sk_OPENSSL_STRING_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const crate::cty::c_char) -> *mut crate::cty::c_char,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_CSTRING {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_CSTRING_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const crate::cty::c_char,
        b: *const *const crate::cty::c_char,
    ) -> crate::cty::c_int,
>;
pub type sk_OPENSSL_CSTRING_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut crate::cty::c_char)>;
pub type sk_OPENSSL_CSTRING_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const crate::cty::c_char) -> *mut crate::cty::c_char,
>;
pub type OPENSSL_BLOCK = *mut crate::cty::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_BLOCK {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_BLOCK_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const crate::cty::c_void,
        b: *const *const crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
pub type sk_OPENSSL_BLOCK_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut crate::cty::c_void)>;
pub type sk_OPENSSL_BLOCK_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const crate::cty::c_void) -> *mut crate::cty::c_void,
>;
extern "C" {
    pub fn ERR_load_CRYPTO_strings() -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRYPTO_dynlock {
    pub dummy: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_CRYPTO_dynlock() {
    assert_eq!(
        ::core::mem::size_of::<CRYPTO_dynlock>(),
        4usize,
        concat!("Size of: ", stringify!(CRYPTO_dynlock))
    );
    assert_eq!(
        ::core::mem::align_of::<CRYPTO_dynlock>(),
        4usize,
        concat!("Alignment of ", stringify!(CRYPTO_dynlock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRYPTO_dynlock>())).dummy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRYPTO_dynlock),
            "::",
            stringify!(dummy)
        )
    );
}
pub type CRYPTO_RWLOCK = crate::cty::c_void;
extern "C" {
    pub fn CRYPTO_THREAD_lock_new() -> *mut CRYPTO_RWLOCK;
}
extern "C" {
    pub fn CRYPTO_THREAD_read_lock(lock: *mut CRYPTO_RWLOCK) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_write_lock(lock: *mut CRYPTO_RWLOCK) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_unlock(lock: *mut CRYPTO_RWLOCK) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_lock_free(lock: *mut CRYPTO_RWLOCK);
}
extern "C" {
    pub fn CRYPTO_atomic_add(
        val: *mut crate::cty::c_int,
        amount: crate::cty::c_int,
        ret: *mut crate::cty::c_int,
        lock: *mut CRYPTO_RWLOCK,
    ) -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_ex_data_st {
    pub sk: *mut stack_st_void,
}
#[test]
fn bindgen_test_layout_crypto_ex_data_st() {
    assert_eq!(
        ::core::mem::size_of::<crypto_ex_data_st>(),
        8usize,
        concat!("Size of: ", stringify!(crypto_ex_data_st))
    );
    assert_eq!(
        ::core::mem::align_of::<crypto_ex_data_st>(),
        8usize,
        concat!("Alignment of ", stringify!(crypto_ex_data_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<crypto_ex_data_st>())).sk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(crypto_ex_data_st),
            "::",
            stringify!(sk)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_void {
    _unused: [u8; 0],
}
pub type sk_void_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const crate::cty::c_void,
        b: *const *const crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
pub type sk_void_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut crate::cty::c_void)>;
pub type sk_void_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const crate::cty::c_void) -> *mut crate::cty::c_void,
>;
extern "C" {
    pub fn CRYPTO_mem_ctrl(mode: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_strlcpy(
        dst: *mut crate::cty::c_char,
        src: *const crate::cty::c_char,
        siz: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn OPENSSL_strlcat(
        dst: *mut crate::cty::c_char,
        src: *const crate::cty::c_char,
        siz: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn OPENSSL_strnlen(str_: *const crate::cty::c_char, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn OPENSSL_buf2hexstr(
        buffer: *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn OPENSSL_hexstr2buf(
        str_: *const crate::cty::c_char,
        len: *mut crate::cty::c_long,
    ) -> *mut crate::cty::c_uchar;
}
extern "C" {
    pub fn OPENSSL_hexchar2int(c: crate::cty::c_uchar) -> crate::cty::c_int;
}
extern "C" {
    pub fn OpenSSL_version_num() -> crate::cty::c_ulong;
}
extern "C" {
    pub fn OpenSSL_version(type_: crate::cty::c_int) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn OPENSSL_issetugid() -> crate::cty::c_int;
}
pub type CRYPTO_EX_new = ::core::option::Option<
    unsafe extern "C" fn(
        parent: *mut crate::cty::c_void,
        ptr: *mut crate::cty::c_void,
        ad: *mut CRYPTO_EX_DATA,
        idx: crate::cty::c_int,
        argl: crate::cty::c_long,
        argp: *mut crate::cty::c_void,
    ),
>;
pub type CRYPTO_EX_free = ::core::option::Option<
    unsafe extern "C" fn(
        parent: *mut crate::cty::c_void,
        ptr: *mut crate::cty::c_void,
        ad: *mut CRYPTO_EX_DATA,
        idx: crate::cty::c_int,
        argl: crate::cty::c_long,
        argp: *mut crate::cty::c_void,
    ),
>;
pub type CRYPTO_EX_dup = ::core::option::Option<
    unsafe extern "C" fn(
        to: *mut CRYPTO_EX_DATA,
        from: *const CRYPTO_EX_DATA,
        from_d: *mut crate::cty::c_void,
        idx: crate::cty::c_int,
        argl: crate::cty::c_long,
        argp: *mut crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
extern "C" {
    pub fn CRYPTO_get_ex_new_index(
        class_index: crate::cty::c_int,
        argl: crate::cty::c_long,
        argp: *mut crate::cty::c_void,
        new_func: CRYPTO_EX_new,
        dup_func: CRYPTO_EX_dup,
        free_func: CRYPTO_EX_free,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_free_ex_index(
        class_index: crate::cty::c_int,
        idx: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_new_ex_data(
        class_index: crate::cty::c_int,
        obj: *mut crate::cty::c_void,
        ad: *mut CRYPTO_EX_DATA,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_dup_ex_data(
        class_index: crate::cty::c_int,
        to: *mut CRYPTO_EX_DATA,
        from: *const CRYPTO_EX_DATA,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_free_ex_data(
        class_index: crate::cty::c_int,
        obj: *mut crate::cty::c_void,
        ad: *mut CRYPTO_EX_DATA,
    );
}
extern "C" {
    pub fn CRYPTO_set_ex_data(
        ad: *mut CRYPTO_EX_DATA,
        idx: crate::cty::c_int,
        val: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_get_ex_data(
        ad: *const CRYPTO_EX_DATA,
        idx: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypto_threadid_st {
    pub dummy: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_crypto_threadid_st() {
    assert_eq!(
        ::core::mem::size_of::<crypto_threadid_st>(),
        4usize,
        concat!("Size of: ", stringify!(crypto_threadid_st))
    );
    assert_eq!(
        ::core::mem::align_of::<crypto_threadid_st>(),
        4usize,
        concat!("Alignment of ", stringify!(crypto_threadid_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<crypto_threadid_st>())).dummy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(crypto_threadid_st),
            "::",
            stringify!(dummy)
        )
    );
}
pub type CRYPTO_THREADID = crypto_threadid_st;
extern "C" {
    pub fn CRYPTO_set_mem_functions(
        m: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: size_t,
                arg2: *const crate::cty::c_char,
                arg3: crate::cty::c_int,
            ) -> *mut crate::cty::c_void,
        >,
        r: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::cty::c_void,
                arg2: size_t,
                arg3: *const crate::cty::c_char,
                arg4: crate::cty::c_int,
            ) -> *mut crate::cty::c_void,
        >,
        f: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::cty::c_void,
                arg2: *const crate::cty::c_char,
                arg3: crate::cty::c_int,
            ),
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_set_mem_debug(flag: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_get_mem_functions(
        m: *mut ::core::option::Option<
            unsafe extern "C" fn(
                arg1: size_t,
                arg2: *const crate::cty::c_char,
                arg3: crate::cty::c_int,
            ) -> *mut crate::cty::c_void,
        >,
        r: *mut ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::cty::c_void,
                arg2: size_t,
                arg3: *const crate::cty::c_char,
                arg4: crate::cty::c_int,
            ) -> *mut crate::cty::c_void,
        >,
        f: *mut ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::cty::c_void,
                arg2: *const crate::cty::c_char,
                arg3: crate::cty::c_int,
            ),
        >,
    );
}
extern "C" {
    pub fn CRYPTO_malloc(
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_zalloc(
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_memdup(
        str_: *const crate::cty::c_void,
        siz: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_strdup(
        str_: *const crate::cty::c_char,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn CRYPTO_strndup(
        str_: *const crate::cty::c_char,
        s: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn CRYPTO_free(
        ptr: *mut crate::cty::c_void,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    );
}
extern "C" {
    pub fn CRYPTO_clear_free(
        ptr: *mut crate::cty::c_void,
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    );
}
extern "C" {
    pub fn CRYPTO_realloc(
        addr: *mut crate::cty::c_void,
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_clear_realloc(
        addr: *mut crate::cty::c_void,
        old_num: size_t,
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_secure_malloc_init(sz: size_t, minsize: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_secure_malloc_done() -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_secure_malloc(
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_secure_zalloc(
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_secure_free(
        ptr: *mut crate::cty::c_void,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    );
}
extern "C" {
    pub fn CRYPTO_secure_clear_free(
        ptr: *mut crate::cty::c_void,
        num: size_t,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    );
}
extern "C" {
    pub fn CRYPTO_secure_allocated(ptr: *const crate::cty::c_void) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_secure_malloc_initialized() -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_secure_actual_size(ptr: *mut crate::cty::c_void) -> size_t;
}
extern "C" {
    pub fn CRYPTO_secure_used() -> size_t;
}
extern "C" {
    pub fn OPENSSL_cleanse(ptr: *mut crate::cty::c_void, len: size_t);
}
extern "C" {
    pub fn OPENSSL_die(
        assertion: *const crate::cty::c_char,
        file: *const crate::cty::c_char,
        line: crate::cty::c_int,
    );
}
extern "C" {
    pub fn OPENSSL_isservice() -> crate::cty::c_int;
}
extern "C" {
    pub fn FIPS_mode() -> crate::cty::c_int;
}
extern "C" {
    pub fn FIPS_mode_set(r: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_init();
}
extern "C" {
    pub fn OPENSSL_fork_prepare();
}
extern "C" {
    pub fn OPENSSL_fork_parent();
}
extern "C" {
    pub fn OPENSSL_fork_child();
}
extern "C" {
    pub fn OPENSSL_gmtime(timer: *const time_t, result: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn OPENSSL_gmtime_adj(
        tm: *mut tm,
        offset_day: crate::cty::c_int,
        offset_sec: crate::cty::c_long,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_gmtime_diff(
        pday: *mut crate::cty::c_int,
        psec: *mut crate::cty::c_int,
        from: *const tm,
        to: *const tm,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_memcmp(
        in_a: *const crate::cty::c_void,
        in_b: *const crate::cty::c_void,
        len: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_cleanup();
}
extern "C" {
    pub fn OPENSSL_init_crypto(
        opts: u64,
        settings: *const OPENSSL_INIT_SETTINGS,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_atexit(
        handler: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_thread_stop();
}
extern "C" {
    pub fn OPENSSL_INIT_new() -> *mut OPENSSL_INIT_SETTINGS;
}
extern "C" {
    pub fn OPENSSL_INIT_set_config_appname(
        settings: *mut OPENSSL_INIT_SETTINGS,
        config_file: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OPENSSL_INIT_free(settings: *mut OPENSSL_INIT_SETTINGS);
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    assert_eq!(
        ::core::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::core::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<sched_param>())).sched_priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type __cpu_mask = crate::cty::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(
        ::core::mem::size_of::<cpu_set_t>(),
        128usize,
        concat!("Size of: ", stringify!(cpu_set_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cpu_set_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cpu_set_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<cpu_set_t>())).__bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cpu_set_t),
            "::",
            stringify!(__bits)
        )
    );
}
extern "C" {
    pub fn __sched_cpucount(__setsize: size_t, __setp: *const cpu_set_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: size_t) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: crate::cty::c_int,
        __param: *const sched_param,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_yield() -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: crate::cty::c_uint,
    pub __writers: crate::cty::c_uint,
    pub __wrphase_futex: crate::cty::c_uint,
    pub __writers_futex: crate::cty::c_uint,
    pub __pad3: crate::cty::c_uint,
    pub __pad4: crate::cty::c_uint,
    pub __cur_writer: crate::cty::c_int,
    pub __shared: crate::cty::c_int,
    pub __rwelision: crate::cty::c_schar,
    pub __pad1: [crate::cty::c_uchar; 7usize],
    pub __pad2: crate::cty::c_ulong,
    pub __flags: crate::cty::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: crate::cty::c_int,
    pub __count: crate::cty::c_uint,
    pub __owner: crate::cty::c_int,
    pub __nusers: crate::cty::c_uint,
    pub __kind: crate::cty::c_int,
    pub __spins: crate::cty::c_short,
    pub __elision: crate::cty::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [crate::cty::c_uint; 2usize],
    pub __g_size: [crate::cty::c_uint; 2usize],
    pub __g1_orig_size: crate::cty::c_uint,
    pub __wrefs: crate::cty::c_uint,
    pub __g_signals: [crate::cty::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: crate::cty::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: crate::cty::c_uint,
    pub __high: crate::cty::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: crate::cty::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: crate::cty::c_uint,
    pub __high: crate::cty::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = crate::cty::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [crate::cty::c_char; 4usize],
    pub __align: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [crate::cty::c_char; 4usize],
    pub __align: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = crate::cty::c_uint;
pub type pthread_once_t = crate::cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [crate::cty::c_char; 56usize],
    pub __align: crate::cty::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [crate::cty::c_char; 40usize],
    pub __align: crate::cty::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [crate::cty::c_char; 48usize],
    pub __align: crate::cty::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type __jmp_buf = [crate::cty::c_long; 8usize];
pub const PTHREAD_CREATE_JOINABLE: crate::cty::c_uint = 0;
pub const PTHREAD_CREATE_DETACHED: crate::cty::c_uint = 1;
pub type _bindgen_ty_1 = crate::cty::c_uint;
pub const PTHREAD_MUTEX_TIMED_NP: crate::cty::c_uint = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: crate::cty::c_uint = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: crate::cty::c_uint = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: crate::cty::c_uint = 3;
pub type _bindgen_ty_2 = crate::cty::c_uint;
pub const PTHREAD_INHERIT_SCHED: crate::cty::c_uint = 0;
pub const PTHREAD_EXPLICIT_SCHED: crate::cty::c_uint = 1;
pub type _bindgen_ty_3 = crate::cty::c_uint;
pub const PTHREAD_SCOPE_SYSTEM: crate::cty::c_uint = 0;
pub const PTHREAD_SCOPE_PROCESS: crate::cty::c_uint = 1;
pub type _bindgen_ty_4 = crate::cty::c_uint;
pub const PTHREAD_PROCESS_PRIVATE: crate::cty::c_uint = 0;
pub const PTHREAD_PROCESS_SHARED: crate::cty::c_uint = 1;
pub type _bindgen_ty_5 = crate::cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::cty::c_void)>,
    pub __arg: *mut crate::cty::c_void,
    pub __canceltype: crate::cty::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[test]
fn bindgen_test_layout__pthread_cleanup_buffer() {
    assert_eq!(
        ::core::mem::size_of::<_pthread_cleanup_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        ::core::mem::align_of::<_pthread_cleanup_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_pthread_cleanup_buffer))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__canceltype as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__canceltype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_pthread_cleanup_buffer>())).__prev as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_pthread_cleanup_buffer),
            "::",
            stringify!(__prev)
        )
    );
}
pub const PTHREAD_CANCEL_ENABLE: crate::cty::c_uint = 0;
pub const PTHREAD_CANCEL_DISABLE: crate::cty::c_uint = 1;
pub type _bindgen_ty_6 = crate::cty::c_uint;
pub const PTHREAD_CANCEL_DEFERRED: crate::cty::c_uint = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: crate::cty::c_uint = 1;
pub type _bindgen_ty_7 = crate::cty::c_uint;
extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut crate::cty::c_void) -> *mut crate::cty::c_void,
        >,
        __arg: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut crate::cty::c_void);
}
extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: crate::cty::c_int,
        __param: *const sched_param,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut crate::cty::c_int,
        __param: *mut sched_param,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(
        __state: crate::cty::c_int,
        __oldstate: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(
        __type: crate::cty::c_int,
        __oldtype: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__pthread_unwind_buf_t__bindgen_ty_1; 1usize],
    pub __pad: [*mut crate::cty::c_void; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t__bindgen_ty_1 {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_unwind_buf_t__bindgen_ty_1>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_unwind_buf_t__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t__bindgen_ty_1>())).__cancel_jmp_buf
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t__bindgen_ty_1>())).__mask_was_saved
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t__bindgen_ty_1),
            "::",
            stringify!(__mask_was_saved)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_unwind_buf_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_unwind_buf_t>(),
        104usize,
        concat!("Size of: ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_unwind_buf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_unwind_buf_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_unwind_buf_t>())).__cancel_jmp_buf as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__cancel_jmp_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_unwind_buf_t>())).__pad as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_unwind_buf_t),
            "::",
            stringify!(__pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::cty::c_void)>,
    pub __cancel_arg: *mut crate::cty::c_void,
    pub __do_it: crate::cty::c_int,
    pub __cancel_type: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout___pthread_cleanup_frame() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cleanup_frame>(),
        24usize,
        concat!("Size of: ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cleanup_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cleanup_frame))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_routine as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__do_it as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__do_it)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cleanup_frame>())).__cancel_type as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cleanup_frame),
            "::",
            stringify!(__cancel_type)
        )
    );
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: crate::cty::c_int,
        __old_ceiling: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut crate::cty::c_void),
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn pthread_atfork(
        __prepare: ::core::option::Option<unsafe extern "C" fn()>,
        __parent: ::core::option::Option<unsafe extern "C" fn()>,
        __child: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> crate::cty::c_int;
}
pub type CRYPTO_ONCE = pthread_once_t;
pub type CRYPTO_THREAD_LOCAL = pthread_key_t;
pub type CRYPTO_THREAD_ID = pthread_t;
extern "C" {
    pub fn CRYPTO_THREAD_run_once(
        once: *mut CRYPTO_ONCE,
        init: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_init_local(
        key: *mut CRYPTO_THREAD_LOCAL,
        cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::cty::c_void)>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_get_local(key: *mut CRYPTO_THREAD_LOCAL) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn CRYPTO_THREAD_set_local(
        key: *mut CRYPTO_THREAD_LOCAL,
        val: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_cleanup_local(key: *mut CRYPTO_THREAD_LOCAL) -> crate::cty::c_int;
}
extern "C" {
    pub fn CRYPTO_THREAD_get_current_id() -> CRYPTO_THREAD_ID;
}
extern "C" {
    pub fn CRYPTO_THREAD_compare_id(a: CRYPTO_THREAD_ID, b: CRYPTO_THREAD_ID) -> crate::cty::c_int;
}
extern "C" {
    pub fn ERR_load_BN_strings() -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_set_flags(b: *mut BIGNUM, n: crate::cty::c_int);
}
extern "C" {
    pub fn BN_get_flags(b: *const BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_with_flags(dest: *mut BIGNUM, b: *const BIGNUM, flags: crate::cty::c_int);
}
extern "C" {
    pub fn BN_GENCB_call(
        cb: *mut BN_GENCB,
        a: crate::cty::c_int,
        b: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GENCB_new() -> *mut BN_GENCB;
}
extern "C" {
    pub fn BN_GENCB_free(cb: *mut BN_GENCB);
}
extern "C" {
    pub fn BN_GENCB_set_old(
        gencb: *mut BN_GENCB,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: crate::cty::c_int,
                arg2: crate::cty::c_int,
                arg3: *mut crate::cty::c_void,
            ),
        >,
        cb_arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn BN_GENCB_set(
        gencb: *mut BN_GENCB,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: crate::cty::c_int,
                arg2: crate::cty::c_int,
                arg3: *mut BN_GENCB,
            ) -> crate::cty::c_int,
        >,
        cb_arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn BN_GENCB_get_arg(cb: *mut BN_GENCB) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn BN_abs_is_word(a: *const BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_zero(a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_one(a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_word(a: *const BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_odd(a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_zero_ex(a: *mut BIGNUM);
}
extern "C" {
    pub fn BN_value_one() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_options() -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BN_CTX_new() -> *mut BN_CTX;
}
extern "C" {
    pub fn BN_CTX_secure_new() -> *mut BN_CTX;
}
extern "C" {
    pub fn BN_CTX_free(c: *mut BN_CTX);
}
extern "C" {
    pub fn BN_CTX_start(ctx: *mut BN_CTX);
}
extern "C" {
    pub fn BN_CTX_get(ctx: *mut BN_CTX) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_CTX_end(ctx: *mut BN_CTX);
}
extern "C" {
    pub fn BN_rand(
        rnd: *mut BIGNUM,
        bits: crate::cty::c_int,
        top: crate::cty::c_int,
        bottom: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_priv_rand(
        rnd: *mut BIGNUM,
        bits: crate::cty::c_int,
        top: crate::cty::c_int,
        bottom: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_priv_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_pseudo_rand(
        rnd: *mut BIGNUM,
        bits: crate::cty::c_int,
        top: crate::cty::c_int,
        bottom: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_pseudo_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_num_bits(a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_num_bits_word(l: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_security_bits(L: crate::cty::c_int, N: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_new() -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_secure_new() -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_clear_free(a: *mut BIGNUM);
}
extern "C" {
    pub fn BN_copy(a: *mut BIGNUM, b: *const BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_swap(a: *mut BIGNUM, b: *mut BIGNUM);
}
extern "C" {
    pub fn BN_bin2bn(
        s: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_bn2bin(a: *const BIGNUM, to: *mut crate::cty::c_uchar) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_bn2binpad(
        a: *const BIGNUM,
        to: *mut crate::cty::c_uchar,
        tolen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_lebin2bn(
        s: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_bn2lebinpad(
        a: *const BIGNUM,
        to: *mut crate::cty::c_uchar,
        tolen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mpi2bn(
        s: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_bn2mpi(a: *const BIGNUM, to: *mut crate::cty::c_uchar) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_sub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_usub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_uadd(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_add(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_sqr(r: *mut BIGNUM, a: *const BIGNUM, ctx: *mut BN_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_set_negative(b: *mut BIGNUM, n: crate::cty::c_int);
}
extern "C" {
    pub fn BN_is_negative(b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_div(
        dv: *mut BIGNUM,
        rem: *mut BIGNUM,
        m: *const BIGNUM,
        d: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nnmod(
        r: *mut BIGNUM,
        m: *const BIGNUM,
        d: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_add(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_add_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_sub(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_sub_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_sqr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_lshift1(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_lshift1_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_lshift(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: crate::cty::c_int,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_lshift_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: crate::cty::c_int,
        m: *const BIGNUM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_word(a: *const BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn BN_div_word(a: *mut BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn BN_mul_word(a: *mut BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_add_word(a: *mut BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_sub_word(a: *mut BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_set_word(a: *mut BIGNUM, w: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_get_word(a: *const BIGNUM) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn BN_cmp(a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_free(a: *mut BIGNUM);
}
extern "C" {
    pub fn BN_is_bit_set(a: *const BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_lshift(r: *mut BIGNUM, a: *const BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_lshift1(r: *mut BIGNUM, a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp_mont(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp_mont_consttime(
        rr: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        in_mont: *mut BN_MONT_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp_mont_word(
        r: *mut BIGNUM,
        a: crate::cty::c_ulong,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp2_mont(
        r: *mut BIGNUM,
        a1: *const BIGNUM,
        p1: *const BIGNUM,
        a2: *const BIGNUM,
        p2: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp_simple(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mask_bits(a: *mut BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_print_fp(fp: *mut FILE, a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_print(bio: *mut BIO, a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_reciprocal(
        r: *mut BIGNUM,
        m: *const BIGNUM,
        len: crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_rshift(r: *mut BIGNUM, a: *const BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_rshift1(r: *mut BIGNUM, a: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_clear(a: *mut BIGNUM);
}
extern "C" {
    pub fn BN_dup(a: *const BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_ucmp(a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_set_bit(a: *mut BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_clear_bit(a: *mut BIGNUM, n: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_bn2hex(a: *const BIGNUM) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BN_bn2dec(a: *const BIGNUM) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BN_hex2bn(a: *mut *mut BIGNUM, str_: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_dec2bn(a: *mut *mut BIGNUM, str_: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_asc2bn(a: *mut *mut BIGNUM, str_: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_gcd(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_kronecker(a: *const BIGNUM, b: *const BIGNUM, ctx: *mut BN_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_inverse(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_mod_sqrt(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_consttime_swap(
        swap: crate::cty::c_ulong,
        a: *mut BIGNUM,
        b: *mut BIGNUM,
        nwords: crate::cty::c_int,
    );
}
extern "C" {
    pub fn BN_generate_prime(
        ret: *mut BIGNUM,
        bits: crate::cty::c_int,
        safe: crate::cty::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: crate::cty::c_int,
                arg2: crate::cty::c_int,
                arg3: *mut crate::cty::c_void,
            ),
        >,
        cb_arg: *mut crate::cty::c_void,
    ) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_is_prime(
        p: *const BIGNUM,
        nchecks: crate::cty::c_int,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: crate::cty::c_int,
                arg2: crate::cty::c_int,
                arg3: *mut crate::cty::c_void,
            ),
        >,
        ctx: *mut BN_CTX,
        cb_arg: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_prime_fasttest(
        p: *const BIGNUM,
        nchecks: crate::cty::c_int,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: crate::cty::c_int,
                arg2: crate::cty::c_int,
                arg3: *mut crate::cty::c_void,
            ),
        >,
        ctx: *mut BN_CTX,
        cb_arg: *mut crate::cty::c_void,
        do_trial_division: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_generate_prime_ex(
        ret: *mut BIGNUM,
        bits: crate::cty::c_int,
        safe: crate::cty::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        cb: *mut BN_GENCB,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_prime_ex(
        p: *const BIGNUM,
        nchecks: crate::cty::c_int,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_is_prime_fasttest_ex(
        p: *const BIGNUM,
        nchecks: crate::cty::c_int,
        ctx: *mut BN_CTX,
        do_trial_division: crate::cty::c_int,
        cb: *mut BN_GENCB,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_X931_generate_Xpq(
        Xp: *mut BIGNUM,
        Xq: *mut BIGNUM,
        nbits: crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_X931_derive_prime_ex(
        p: *mut BIGNUM,
        p1: *mut BIGNUM,
        p2: *mut BIGNUM,
        Xp: *const BIGNUM,
        Xp1: *const BIGNUM,
        Xp2: *const BIGNUM,
        e: *const BIGNUM,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_X931_generate_prime_ex(
        p: *mut BIGNUM,
        p1: *mut BIGNUM,
        p2: *mut BIGNUM,
        Xp1: *mut BIGNUM,
        Xp2: *mut BIGNUM,
        Xp: *const BIGNUM,
        e: *const BIGNUM,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_MONT_CTX_new() -> *mut BN_MONT_CTX;
}
extern "C" {
    pub fn BN_mod_mul_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_to_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_from_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_MONT_CTX_free(mont: *mut BN_MONT_CTX);
}
extern "C" {
    pub fn BN_MONT_CTX_set(
        mont: *mut BN_MONT_CTX,
        mod_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_MONT_CTX_copy(to: *mut BN_MONT_CTX, from: *mut BN_MONT_CTX) -> *mut BN_MONT_CTX;
}
extern "C" {
    pub fn BN_MONT_CTX_set_locked(
        pmont: *mut *mut BN_MONT_CTX,
        lock: *mut CRYPTO_RWLOCK,
        mod_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BN_MONT_CTX;
}
extern "C" {
    pub fn BN_BLINDING_new(
        A: *const BIGNUM,
        Ai: *const BIGNUM,
        mod_: *mut BIGNUM,
    ) -> *mut BN_BLINDING;
}
extern "C" {
    pub fn BN_BLINDING_free(b: *mut BN_BLINDING);
}
extern "C" {
    pub fn BN_BLINDING_update(b: *mut BN_BLINDING, ctx: *mut BN_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_convert(
        n: *mut BIGNUM,
        b: *mut BN_BLINDING,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_invert(
        n: *mut BIGNUM,
        b: *mut BN_BLINDING,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_convert_ex(
        n: *mut BIGNUM,
        r: *mut BIGNUM,
        b: *mut BN_BLINDING,
        arg1: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_invert_ex(
        n: *mut BIGNUM,
        r: *const BIGNUM,
        b: *mut BN_BLINDING,
        arg1: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_is_current_thread(b: *mut BN_BLINDING) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_set_current_thread(b: *mut BN_BLINDING);
}
extern "C" {
    pub fn BN_BLINDING_lock(b: *mut BN_BLINDING) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_unlock(b: *mut BN_BLINDING) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_BLINDING_get_flags(arg1: *const BN_BLINDING) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn BN_BLINDING_set_flags(arg1: *mut BN_BLINDING, arg2: crate::cty::c_ulong);
}
extern "C" {
    pub fn BN_BLINDING_create_param(
        b: *mut BN_BLINDING,
        e: *const BIGNUM,
        m: *mut BIGNUM,
        ctx: *mut BN_CTX,
        bn_mod_exp: ::core::option::Option<
            unsafe extern "C" fn(
                r: *mut BIGNUM,
                a: *const BIGNUM,
                p: *const BIGNUM,
                m: *const BIGNUM,
                ctx: *mut BN_CTX,
                m_ctx: *mut BN_MONT_CTX,
            ) -> crate::cty::c_int,
        >,
        m_ctx: *mut BN_MONT_CTX,
    ) -> *mut BN_BLINDING;
}
extern "C" {
    pub fn BN_set_params(
        mul: crate::cty::c_int,
        high: crate::cty::c_int,
        low: crate::cty::c_int,
        mont: crate::cty::c_int,
    );
}
extern "C" {
    pub fn BN_get_params(which: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_RECP_CTX_new() -> *mut BN_RECP_CTX;
}
extern "C" {
    pub fn BN_RECP_CTX_free(recp: *mut BN_RECP_CTX);
}
extern "C" {
    pub fn BN_RECP_CTX_set(
        recp: *mut BN_RECP_CTX,
        rdiv: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_mul_reciprocal(
        r: *mut BIGNUM,
        x: *const BIGNUM,
        y: *const BIGNUM,
        recp: *mut BN_RECP_CTX,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_mod_exp_recp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_div_recp(
        dv: *mut BIGNUM,
        rem: *mut BIGNUM,
        m: *const BIGNUM,
        recp: *mut BN_RECP_CTX,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_add(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod(r: *mut BIGNUM, a: *const BIGNUM, p: *const BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_sqr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_inv(
        r: *mut BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_div(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_sqrt(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_solve_quad(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_mul_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_sqr_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_inv_arr(
        r: *mut BIGNUM,
        b: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_div_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_exp_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_sqrt_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_mod_solve_quad_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const crate::cty::c_int,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_poly2arr(
        a: *const BIGNUM,
        p: *mut crate::cty::c_int,
        max: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_GF2m_arr2poly(p: *const crate::cty::c_int, a: *mut BIGNUM) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nist_mod_192(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nist_mod_224(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nist_mod_256(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nist_mod_384(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_nist_mod_521(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_get0_nist_prime_192() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_get0_nist_prime_224() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_get0_nist_prime_256() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_get0_nist_prime_384() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_get0_nist_prime_521() -> *const BIGNUM;
}
extern "C" {
    pub fn BN_nist_mod_func(
        p: *const BIGNUM,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            p: *mut BIGNUM,
            arg1: *const BIGNUM,
            arg2: *const BIGNUM,
            arg3: *mut BN_CTX,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BN_generate_dsa_nonce(
        out: *mut BIGNUM,
        range: *const BIGNUM,
        priv_: *const BIGNUM,
        message: *const crate::cty::c_uchar,
        message_len: size_t,
        ctx: *mut BN_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BN_get_rfc2409_prime_768(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc2409_prime_1024(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_1536(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_2048(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_3072(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_4096(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_6144(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_get_rfc3526_prime_8192(bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn BN_bntest_rand(
        rnd: *mut BIGNUM,
        bits: crate::cty::c_int,
        top: crate::cty::c_int,
        bottom: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
pub type TpmCryptSetSymKeyCall_t = ::core::option::Option<
    unsafe extern "C" fn(in_: *const BYTE, out: *mut BYTE, keySchedule: *mut crate::cty::c_void),
>;
extern "C" {
    pub fn ERR_load_BIO_strings() -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct bio_addr_st {
    _unused: [u8; 0],
}
pub type BIO_ADDR = bio_addr_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_addrinfo_st {
    _unused: [u8; 0],
}
pub type BIO_ADDRINFO = bio_addrinfo_st;
extern "C" {
    pub fn BIO_get_new_index() -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_flags(b: *mut BIO, flags: crate::cty::c_int);
}
extern "C" {
    pub fn BIO_test_flags(b: *const BIO, flags: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_clear_flags(b: *mut BIO, flags: crate::cty::c_int);
}
pub type BIO_callback_fn = ::core::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        oper: crate::cty::c_int,
        argp: *const crate::cty::c_char,
        argi: crate::cty::c_int,
        argl: crate::cty::c_long,
        ret: crate::cty::c_long,
    ) -> crate::cty::c_long,
>;
pub type BIO_callback_fn_ex = ::core::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        oper: crate::cty::c_int,
        argp: *const crate::cty::c_char,
        len: size_t,
        argi: crate::cty::c_int,
        argl: crate::cty::c_long,
        ret: crate::cty::c_int,
        processed: *mut size_t,
    ) -> crate::cty::c_long,
>;
extern "C" {
    pub fn BIO_get_callback(b: *const BIO) -> BIO_callback_fn;
}
extern "C" {
    pub fn BIO_set_callback(b: *mut BIO, callback: BIO_callback_fn);
}
extern "C" {
    pub fn BIO_get_callback_ex(b: *const BIO) -> BIO_callback_fn_ex;
}
extern "C" {
    pub fn BIO_set_callback_ex(b: *mut BIO, callback: BIO_callback_fn_ex);
}
extern "C" {
    pub fn BIO_get_callback_arg(b: *const BIO) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BIO_set_callback_arg(b: *mut BIO, arg: *mut crate::cty::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_method_st {
    _unused: [u8; 0],
}
pub type BIO_METHOD = bio_method_st;
extern "C" {
    pub fn BIO_method_name(b: *const BIO) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn BIO_method_type(b: *const BIO) -> crate::cty::c_int;
}
pub type BIO_info_cb = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut BIO,
        arg2: crate::cty::c_int,
        arg3: crate::cty::c_int,
    ) -> crate::cty::c_int,
>;
pub type bio_info_cb = BIO_info_cb;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_BIO {
    _unused: [u8; 0],
}
pub type sk_BIO_compfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const *const BIO, b: *const *const BIO) -> crate::cty::c_int,
>;
pub type sk_BIO_freefunc = ::core::option::Option<unsafe extern "C" fn(a: *mut BIO)>;
pub type sk_BIO_copyfunc = ::core::option::Option<unsafe extern "C" fn(a: *const BIO) -> *mut BIO>;
pub type asn1_ps_func = ::core::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        pbuf: *mut *mut crate::cty::c_uchar,
        plen: *mut crate::cty::c_int,
        parg: *mut crate::cty::c_void,
    ) -> crate::cty::c_int,
>;
extern "C" {
    pub fn BIO_ctrl_pending(b: *mut BIO) -> size_t;
}
extern "C" {
    pub fn BIO_ctrl_wpending(b: *mut BIO) -> size_t;
}
extern "C" {
    pub fn BIO_ctrl_get_write_guarantee(b: *mut BIO) -> size_t;
}
extern "C" {
    pub fn BIO_ctrl_get_read_request(b: *mut BIO) -> size_t;
}
extern "C" {
    pub fn BIO_ctrl_reset_read_request(b: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_ex_data(
        bio: *mut BIO,
        idx: crate::cty::c_int,
        data: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_get_ex_data(bio: *mut BIO, idx: crate::cty::c_int) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn BIO_number_read(bio: *mut BIO) -> u64;
}
extern "C" {
    pub fn BIO_number_written(bio: *mut BIO) -> u64;
}
extern "C" {
    pub fn BIO_asn1_set_prefix(
        b: *mut BIO,
        prefix: asn1_ps_func,
        prefix_free: asn1_ps_func,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_asn1_get_prefix(
        b: *mut BIO,
        pprefix: *mut asn1_ps_func,
        pprefix_free: *mut asn1_ps_func,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_asn1_set_suffix(
        b: *mut BIO,
        suffix: asn1_ps_func,
        suffix_free: asn1_ps_func,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_asn1_get_suffix(
        b: *mut BIO,
        psuffix: *mut asn1_ps_func,
        psuffix_free: *mut asn1_ps_func,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_s_file() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_new_file(
        filename: *const crate::cty::c_char,
        mode: *const crate::cty::c_char,
    ) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new_fp(stream: *mut FILE, close_flag: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new(type_: *const BIO_METHOD) -> *mut BIO;
}
extern "C" {
    pub fn BIO_free(a: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_data(a: *mut BIO, ptr: *mut crate::cty::c_void);
}
extern "C" {
    pub fn BIO_get_data(a: *mut BIO) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn BIO_set_init(a: *mut BIO, init: crate::cty::c_int);
}
extern "C" {
    pub fn BIO_get_init(a: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_shutdown(a: *mut BIO, shut: crate::cty::c_int);
}
extern "C" {
    pub fn BIO_get_shutdown(a: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_vfree(a: *mut BIO);
}
extern "C" {
    pub fn BIO_up_ref(a: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_read(
        b: *mut BIO,
        data: *mut crate::cty::c_void,
        dlen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_read_ex(
        b: *mut BIO,
        data: *mut crate::cty::c_void,
        dlen: size_t,
        readbytes: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_gets(
        bp: *mut BIO,
        buf: *mut crate::cty::c_char,
        size: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_write(
        b: *mut BIO,
        data: *const crate::cty::c_void,
        dlen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_write_ex(
        b: *mut BIO,
        data: *const crate::cty::c_void,
        dlen: size_t,
        written: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_puts(bp: *mut BIO, buf: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_indent(
        b: *mut BIO,
        indent: crate::cty::c_int,
        max: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ctrl(
        bp: *mut BIO,
        cmd: crate::cty::c_int,
        larg: crate::cty::c_long,
        parg: *mut crate::cty::c_void,
    ) -> crate::cty::c_long;
}
extern "C" {
    pub fn BIO_callback_ctrl(
        b: *mut BIO,
        cmd: crate::cty::c_int,
        fp: BIO_info_cb,
    ) -> crate::cty::c_long;
}
extern "C" {
    pub fn BIO_ptr_ctrl(
        bp: *mut BIO,
        cmd: crate::cty::c_int,
        larg: crate::cty::c_long,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn BIO_int_ctrl(
        bp: *mut BIO,
        cmd: crate::cty::c_int,
        larg: crate::cty::c_long,
        iarg: crate::cty::c_int,
    ) -> crate::cty::c_long;
}
extern "C" {
    pub fn BIO_push(b: *mut BIO, append: *mut BIO) -> *mut BIO;
}
extern "C" {
    pub fn BIO_pop(b: *mut BIO) -> *mut BIO;
}
extern "C" {
    pub fn BIO_free_all(a: *mut BIO);
}
extern "C" {
    pub fn BIO_find_type(b: *mut BIO, bio_type: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_next(b: *mut BIO) -> *mut BIO;
}
extern "C" {
    pub fn BIO_set_next(b: *mut BIO, next: *mut BIO);
}
extern "C" {
    pub fn BIO_get_retry_BIO(bio: *mut BIO, reason: *mut crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_get_retry_reason(bio: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_retry_reason(bio: *mut BIO, reason: crate::cty::c_int);
}
extern "C" {
    pub fn BIO_dup_chain(in_: *mut BIO) -> *mut BIO;
}
extern "C" {
    pub fn BIO_nread0(bio: *mut BIO, buf: *mut *mut crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_nread(
        bio: *mut BIO,
        buf: *mut *mut crate::cty::c_char,
        num: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_nwrite0(bio: *mut BIO, buf: *mut *mut crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_nwrite(
        bio: *mut BIO,
        buf: *mut *mut crate::cty::c_char,
        num: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_debug_callback(
        bio: *mut BIO,
        cmd: crate::cty::c_int,
        argp: *const crate::cty::c_char,
        argi: crate::cty::c_int,
        argl: crate::cty::c_long,
        ret: crate::cty::c_long,
    ) -> crate::cty::c_long;
}
extern "C" {
    pub fn BIO_s_mem() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_secmem() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_new_mem_buf(buf: *const crate::cty::c_void, len: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_s_socket() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_connect() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_accept() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_fd() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_log() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_bio() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_null() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_null() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_buffer() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_linebuffer() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_nbio_test() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_s_datagram() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_dgram_non_fatal_error(error: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_new_dgram(fd: crate::cty::c_int, close_flag: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_sock_should_retry(i: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_sock_non_fatal_error(error: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_fd_should_retry(i: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_fd_non_fatal_error(error: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump_cb(
        cb: ::core::option::Option<
            unsafe extern "C" fn(
                data: *const crate::cty::c_void,
                len: size_t,
                u: *mut crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
        u: *mut crate::cty::c_void,
        s: *const crate::cty::c_char,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump_indent_cb(
        cb: ::core::option::Option<
            unsafe extern "C" fn(
                data: *const crate::cty::c_void,
                len: size_t,
                u: *mut crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
        u: *mut crate::cty::c_void,
        s: *const crate::cty::c_char,
        len: crate::cty::c_int,
        indent: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump(
        b: *mut BIO,
        bytes: *const crate::cty::c_char,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump_indent(
        b: *mut BIO,
        bytes: *const crate::cty::c_char,
        len: crate::cty::c_int,
        indent: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump_fp(
        fp: *mut FILE,
        s: *const crate::cty::c_char,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_dump_indent_fp(
        fp: *mut FILE,
        s: *const crate::cty::c_char,
        len: crate::cty::c_int,
        indent: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_hex_string(
        out: *mut BIO,
        indent: crate::cty::c_int,
        width: crate::cty::c_int,
        data: *mut crate::cty::c_uchar,
        datalen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDR_new() -> *mut BIO_ADDR;
}
extern "C" {
    pub fn BIO_ADDR_rawmake(
        ap: *mut BIO_ADDR,
        family: crate::cty::c_int,
        where_: *const crate::cty::c_void,
        wherelen: size_t,
        port: crate::cty::c_ushort,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDR_free(arg1: *mut BIO_ADDR);
}
extern "C" {
    pub fn BIO_ADDR_clear(ap: *mut BIO_ADDR);
}
extern "C" {
    pub fn BIO_ADDR_family(ap: *const BIO_ADDR) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDR_rawaddress(
        ap: *const BIO_ADDR,
        p: *mut crate::cty::c_void,
        l: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDR_rawport(ap: *const BIO_ADDR) -> crate::cty::c_ushort;
}
extern "C" {
    pub fn BIO_ADDR_hostname_string(
        ap: *const BIO_ADDR,
        numeric: crate::cty::c_int,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BIO_ADDR_service_string(
        ap: *const BIO_ADDR,
        numeric: crate::cty::c_int,
    ) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BIO_ADDR_path_string(ap: *const BIO_ADDR) -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn BIO_ADDRINFO_next(bai: *const BIO_ADDRINFO) -> *const BIO_ADDRINFO;
}
extern "C" {
    pub fn BIO_ADDRINFO_family(bai: *const BIO_ADDRINFO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDRINFO_socktype(bai: *const BIO_ADDRINFO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDRINFO_protocol(bai: *const BIO_ADDRINFO) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_ADDRINFO_address(bai: *const BIO_ADDRINFO) -> *const BIO_ADDR;
}
extern "C" {
    pub fn BIO_ADDRINFO_free(bai: *mut BIO_ADDRINFO);
}
pub const BIO_hostserv_priorities_BIO_PARSE_PRIO_HOST: BIO_hostserv_priorities = 0;
pub const BIO_hostserv_priorities_BIO_PARSE_PRIO_SERV: BIO_hostserv_priorities = 1;
pub type BIO_hostserv_priorities = crate::cty::c_uint;
extern "C" {
    pub fn BIO_parse_hostserv(
        hostserv: *const crate::cty::c_char,
        host: *mut *mut crate::cty::c_char,
        service: *mut *mut crate::cty::c_char,
        hostserv_prio: BIO_hostserv_priorities,
    ) -> crate::cty::c_int;
}
pub const BIO_lookup_type_BIO_LOOKUP_CLIENT: BIO_lookup_type = 0;
pub const BIO_lookup_type_BIO_LOOKUP_SERVER: BIO_lookup_type = 1;
pub type BIO_lookup_type = crate::cty::c_uint;
extern "C" {
    pub fn BIO_lookup(
        host: *const crate::cty::c_char,
        service: *const crate::cty::c_char,
        lookup_type: BIO_lookup_type,
        family: crate::cty::c_int,
        socktype: crate::cty::c_int,
        res: *mut *mut BIO_ADDRINFO,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_lookup_ex(
        host: *const crate::cty::c_char,
        service: *const crate::cty::c_char,
        lookup_type: crate::cty::c_int,
        family: crate::cty::c_int,
        socktype: crate::cty::c_int,
        protocol: crate::cty::c_int,
        res: *mut *mut BIO_ADDRINFO,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_sock_error(sock: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_socket_ioctl(
        fd: crate::cty::c_int,
        type_: crate::cty::c_long,
        arg: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_socket_nbio(fd: crate::cty::c_int, mode: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_sock_init() -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_set_tcp_ndelay(
        sock: crate::cty::c_int,
        turn_on: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hostent {
    _unused: [u8; 0],
}
extern "C" {
    pub fn BIO_gethostbyname(name: *const crate::cty::c_char) -> *mut hostent;
}
extern "C" {
    pub fn BIO_get_port(
        str_: *const crate::cty::c_char,
        port_ptr: *mut crate::cty::c_ushort,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_get_host_ip(
        str_: *const crate::cty::c_char,
        ip: *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_get_accept_socket(
        host_port: *mut crate::cty::c_char,
        mode: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_accept(
        sock: crate::cty::c_int,
        ip_port: *mut *mut crate::cty::c_char,
    ) -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BIO_sock_info_u {
    pub addr: *mut BIO_ADDR,
}
#[test]
fn bindgen_test_layout_BIO_sock_info_u() {
    assert_eq!(
        ::core::mem::size_of::<BIO_sock_info_u>(),
        8usize,
        concat!("Size of: ", stringify!(BIO_sock_info_u))
    );
    assert_eq!(
        ::core::mem::align_of::<BIO_sock_info_u>(),
        8usize,
        concat!("Alignment of ", stringify!(BIO_sock_info_u))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<BIO_sock_info_u>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BIO_sock_info_u),
            "::",
            stringify!(addr)
        )
    );
}
pub const BIO_sock_info_type_BIO_SOCK_INFO_ADDRESS: BIO_sock_info_type = 0;
pub type BIO_sock_info_type = crate::cty::c_uint;
extern "C" {
    pub fn BIO_sock_info(
        sock: crate::cty::c_int,
        type_: BIO_sock_info_type,
        info: *mut BIO_sock_info_u,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_socket(
        domain: crate::cty::c_int,
        socktype: crate::cty::c_int,
        protocol: crate::cty::c_int,
        options: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_connect(
        sock: crate::cty::c_int,
        addr: *const BIO_ADDR,
        options: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_bind(
        sock: crate::cty::c_int,
        addr: *const BIO_ADDR,
        options: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_listen(
        sock: crate::cty::c_int,
        addr: *const BIO_ADDR,
        options: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_accept_ex(
        accept_sock: crate::cty::c_int,
        addr: *mut BIO_ADDR,
        options: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_closesocket(sock: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_new_socket(sock: crate::cty::c_int, close_flag: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new_connect(host_port: *const crate::cty::c_char) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new_accept(host_port: *const crate::cty::c_char) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new_fd(fd: crate::cty::c_int, close_flag: crate::cty::c_int) -> *mut BIO;
}
extern "C" {
    pub fn BIO_new_bio_pair(
        bio1: *mut *mut BIO,
        writebuf1: size_t,
        bio2: *mut *mut BIO,
        writebuf2: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_copy_next_retry(b: *mut BIO);
}
extern "C" {
    pub fn BIO_printf(bio: *mut BIO, format: *const crate::cty::c_char, ...) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_vprintf(
        bio: *mut BIO,
        format: *const crate::cty::c_char,
        args: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_snprintf(
        buf: *mut crate::cty::c_char,
        n: size_t,
        format: *const crate::cty::c_char,
        ...
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_vsnprintf(
        buf: *mut crate::cty::c_char,
        n: size_t,
        format: *const crate::cty::c_char,
        args: *mut __va_list_tag,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_new(
        type_: crate::cty::c_int,
        name: *const crate::cty::c_char,
    ) -> *mut BIO_METHOD;
}
extern "C" {
    pub fn BIO_meth_free(biom: *mut BIO_METHOD);
}
extern "C" {
    pub fn BIO_meth_get_write(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *const crate::cty::c_char,
            arg2: crate::cty::c_int,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_get_write_ex(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *const crate::cty::c_char,
            arg2: size_t,
            arg3: *mut size_t,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_set_write(
        biom: *mut BIO_METHOD,
        write: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const crate::cty::c_char,
                arg3: crate::cty::c_int,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_set_write_ex(
        biom: *mut BIO_METHOD,
        bwrite: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const crate::cty::c_char,
                arg3: size_t,
                arg4: *mut size_t,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_read(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut crate::cty::c_char,
            arg2: crate::cty::c_int,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_get_read_ex(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut crate::cty::c_char,
            arg2: size_t,
            arg3: *mut size_t,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_set_read(
        biom: *mut BIO_METHOD,
        read: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut crate::cty::c_char,
                arg3: crate::cty::c_int,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_set_read_ex(
        biom: *mut BIO_METHOD,
        bread: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut crate::cty::c_char,
                arg3: size_t,
                arg4: *mut size_t,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_puts(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(biom: *mut BIO, arg1: *const crate::cty::c_char) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_set_puts(
        biom: *mut BIO_METHOD,
        puts: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const crate::cty::c_char,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_gets(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut crate::cty::c_char,
            arg2: crate::cty::c_int,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn BIO_meth_set_gets(
        biom: *mut BIO_METHOD,
        gets: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut crate::cty::c_char,
                arg3: crate::cty::c_int,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_ctrl(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: crate::cty::c_int,
            arg2: crate::cty::c_long,
            arg3: *mut crate::cty::c_void,
        ) -> crate::cty::c_long,
    >;
}
extern "C" {
    pub fn BIO_meth_set_ctrl(
        biom: *mut BIO_METHOD,
        ctrl: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: crate::cty::c_int,
                arg3: crate::cty::c_long,
                arg4: *mut crate::cty::c_void,
            ) -> crate::cty::c_long,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_create(
        bion: *const BIO_METHOD,
    ) -> ::core::option::Option<unsafe extern "C" fn(bion: *mut BIO) -> crate::cty::c_int>;
}
extern "C" {
    pub fn BIO_meth_set_create(
        biom: *mut BIO_METHOD,
        create: ::core::option::Option<unsafe extern "C" fn(arg1: *mut BIO) -> crate::cty::c_int>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_destroy(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<unsafe extern "C" fn(biom: *mut BIO) -> crate::cty::c_int>;
}
extern "C" {
    pub fn BIO_meth_set_destroy(
        biom: *mut BIO_METHOD,
        destroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut BIO) -> crate::cty::c_int>,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_meth_get_callback_ctrl(
        biom: *const BIO_METHOD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: crate::cty::c_int,
            arg2: BIO_info_cb,
        ) -> crate::cty::c_long,
    >;
}
extern "C" {
    pub fn BIO_meth_set_callback_ctrl(
        biom: *mut BIO_METHOD,
        callback_ctrl: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: crate::cty::c_int,
                arg3: BIO_info_cb,
            ) -> crate::cty::c_long,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ERR_load_EVP_strings() -> crate::cty::c_int;
}
extern "C" {
    pub fn ERR_load_ASN1_strings() -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_X509_ALGOR {
    _unused: [u8; 0],
}
pub type sk_X509_ALGOR_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const X509_ALGOR,
        b: *const *const X509_ALGOR,
    ) -> crate::cty::c_int,
>;
pub type sk_X509_ALGOR_freefunc = ::core::option::Option<unsafe extern "C" fn(a: *mut X509_ALGOR)>;
pub type sk_X509_ALGOR_copyfunc =
    ::core::option::Option<unsafe extern "C" fn(a: *const X509_ALGOR) -> *mut X509_ALGOR>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_string_st {
    pub length: crate::cty::c_int,
    pub type_: crate::cty::c_int,
    pub data: *mut crate::cty::c_uchar,
    pub flags: crate::cty::c_long,
}
#[test]
fn bindgen_test_layout_asn1_string_st() {
    assert_eq!(
        ::core::mem::size_of::<asn1_string_st>(),
        24usize,
        concat!("Size of: ", stringify!(asn1_string_st))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_string_st>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_string_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_st>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_st),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_st>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_st),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_st>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_st),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_st>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_st),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ENCODING_st {
    pub enc: *mut crate::cty::c_uchar,
    pub len: crate::cty::c_long,
    pub modified: crate::cty::c_int,
}
#[test]
fn bindgen_test_layout_ASN1_ENCODING_st() {
    assert_eq!(
        ::core::mem::size_of::<ASN1_ENCODING_st>(),
        24usize,
        concat!("Size of: ", stringify!(ASN1_ENCODING_st))
    );
    assert_eq!(
        ::core::mem::align_of::<ASN1_ENCODING_st>(),
        8usize,
        concat!("Alignment of ", stringify!(ASN1_ENCODING_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ASN1_ENCODING_st>())).enc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ASN1_ENCODING_st),
            "::",
            stringify!(enc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ASN1_ENCODING_st>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ASN1_ENCODING_st),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ASN1_ENCODING_st>())).modified as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ASN1_ENCODING_st),
            "::",
            stringify!(modified)
        )
    );
}
pub type ASN1_ENCODING = ASN1_ENCODING_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_string_table_st {
    pub nid: crate::cty::c_int,
    pub minsize: crate::cty::c_long,
    pub maxsize: crate::cty::c_long,
    pub mask: crate::cty::c_ulong,
    pub flags: crate::cty::c_ulong,
}
#[test]
fn bindgen_test_layout_asn1_string_table_st() {
    assert_eq!(
        ::core::mem::size_of::<asn1_string_table_st>(),
        40usize,
        concat!("Size of: ", stringify!(asn1_string_table_st))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_string_table_st>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_string_table_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_table_st>())).nid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_table_st),
            "::",
            stringify!(nid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_table_st>())).minsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_table_st),
            "::",
            stringify!(minsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_table_st>())).maxsize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_table_st),
            "::",
            stringify!(maxsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_table_st>())).mask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_table_st),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_string_table_st>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_string_table_st),
            "::",
            stringify!(flags)
        )
    );
}
pub type ASN1_STRING_TABLE = asn1_string_table_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_STRING_TABLE {
    _unused: [u8; 0],
}
pub type sk_ASN1_STRING_TABLE_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_STRING_TABLE,
        b: *const *const ASN1_STRING_TABLE,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_STRING_TABLE_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_STRING_TABLE)>;
pub type sk_ASN1_STRING_TABLE_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const ASN1_STRING_TABLE) -> *mut ASN1_STRING_TABLE,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TEMPLATE_st {
    _unused: [u8; 0],
}
pub type ASN1_TEMPLATE = ASN1_TEMPLATE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TLC_st {
    _unused: [u8; 0],
}
pub type ASN1_TLC = ASN1_TLC_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_VALUE_st {
    _unused: [u8; 0],
}
pub type ASN1_VALUE = ASN1_VALUE_st;
pub type d2i_of_void = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *mut crate::cty::c_void,
        arg2: *mut *const crate::cty::c_uchar,
        arg3: crate::cty::c_long,
    ) -> *mut crate::cty::c_void,
>;
pub type i2d_of_void = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut crate::cty::c_void,
        arg2: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int,
>;
pub type ASN1_ITEM_EXP = ASN1_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_INTEGER {
    _unused: [u8; 0],
}
pub type sk_ASN1_INTEGER_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_INTEGER,
        b: *const *const ASN1_INTEGER,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_INTEGER_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_INTEGER)>;
pub type sk_ASN1_INTEGER_copyfunc =
    ::core::option::Option<unsafe extern "C" fn(a: *const ASN1_INTEGER) -> *mut ASN1_INTEGER>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_GENERALSTRING {
    _unused: [u8; 0],
}
pub type sk_ASN1_GENERALSTRING_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_GENERALSTRING,
        b: *const *const ASN1_GENERALSTRING,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_GENERALSTRING_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_GENERALSTRING)>;
pub type sk_ASN1_GENERALSTRING_copyfunc = ::core::option::Option<
    unsafe extern "C" fn(a: *const ASN1_GENERALSTRING) -> *mut ASN1_GENERALSTRING,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_UTF8STRING {
    _unused: [u8; 0],
}
pub type sk_ASN1_UTF8STRING_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_UTF8STRING,
        b: *const *const ASN1_UTF8STRING,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_UTF8STRING_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_UTF8STRING)>;
pub type sk_ASN1_UTF8STRING_copyfunc =
    ::core::option::Option<unsafe extern "C" fn(a: *const ASN1_UTF8STRING) -> *mut ASN1_UTF8STRING>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_type_st {
    pub type_: crate::cty::c_int,
    pub value: asn1_type_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union asn1_type_st__bindgen_ty_1 {
    pub ptr: *mut crate::cty::c_char,
    pub boolean: ASN1_BOOLEAN,
    pub asn1_string: *mut ASN1_STRING,
    pub object: *mut ASN1_OBJECT,
    pub integer: *mut ASN1_INTEGER,
    pub enumerated: *mut ASN1_ENUMERATED,
    pub bit_string: *mut ASN1_BIT_STRING,
    pub octet_string: *mut ASN1_OCTET_STRING,
    pub printablestring: *mut ASN1_PRINTABLESTRING,
    pub t61string: *mut ASN1_T61STRING,
    pub ia5string: *mut ASN1_IA5STRING,
    pub generalstring: *mut ASN1_GENERALSTRING,
    pub bmpstring: *mut ASN1_BMPSTRING,
    pub universalstring: *mut ASN1_UNIVERSALSTRING,
    pub utctime: *mut ASN1_UTCTIME,
    pub generalizedtime: *mut ASN1_GENERALIZEDTIME,
    pub visiblestring: *mut ASN1_VISIBLESTRING,
    pub utf8string: *mut ASN1_UTF8STRING,
    pub set: *mut ASN1_STRING,
    pub sequence: *mut ASN1_STRING,
    pub asn1_value: *mut ASN1_VALUE,
}
#[test]
fn bindgen_test_layout_asn1_type_st__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<asn1_type_st__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(asn1_type_st__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_type_st__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_type_st__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).boolean as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(boolean)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).asn1_string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(asn1_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).object as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).integer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(integer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).enumerated as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(enumerated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).bit_string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(bit_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).octet_string as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(octet_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).printablestring as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(printablestring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).t61string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(t61string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).ia5string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(ia5string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).generalstring as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(generalstring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).bmpstring as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(bmpstring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).universalstring as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(universalstring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).utctime as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(utctime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).generalizedtime as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(generalizedtime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).visiblestring as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(visiblestring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).utf8string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(utf8string)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).set as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).sequence as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(sequence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<asn1_type_st__bindgen_ty_1>())).asn1_value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st__bindgen_ty_1),
            "::",
            stringify!(asn1_value)
        )
    );
}
#[test]
fn bindgen_test_layout_asn1_type_st() {
    assert_eq!(
        ::core::mem::size_of::<asn1_type_st>(),
        16usize,
        concat!("Size of: ", stringify!(asn1_type_st))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_type_st>(),
        8usize,
        concat!("Alignment of ", stringify!(asn1_type_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_type_st>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_type_st>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_type_st),
            "::",
            stringify!(value)
        )
    );
}
pub type ASN1_TYPE = asn1_type_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_TYPE {
    _unused: [u8; 0],
}
pub type sk_ASN1_TYPE_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_TYPE,
        b: *const *const ASN1_TYPE,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_TYPE_freefunc = ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_TYPE)>;
pub type sk_ASN1_TYPE_copyfunc =
    ::core::option::Option<unsafe extern "C" fn(a: *const ASN1_TYPE) -> *mut ASN1_TYPE>;
pub type ASN1_SEQUENCE_ANY = stack_st_ASN1_TYPE;
extern "C" {
    pub fn d2i_ASN1_SEQUENCE_ANY(
        a: *mut *mut ASN1_SEQUENCE_ANY,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
extern "C" {
    pub fn i2d_ASN1_SEQUENCE_ANY(
        a: *const ASN1_SEQUENCE_ANY,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_SEQUENCE_ANY_it: ASN1_ITEM;
}
extern "C" {
    pub fn d2i_ASN1_SET_ANY(
        a: *mut *mut ASN1_SEQUENCE_ANY,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
extern "C" {
    pub fn i2d_ASN1_SET_ANY(
        a: *const ASN1_SEQUENCE_ANY,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_SET_ANY_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BIT_STRING_BITNAME_st {
    pub bitnum: crate::cty::c_int,
    pub lname: *const crate::cty::c_char,
    pub sname: *const crate::cty::c_char,
}
#[test]
fn bindgen_test_layout_BIT_STRING_BITNAME_st() {
    assert_eq!(
        ::core::mem::size_of::<BIT_STRING_BITNAME_st>(),
        24usize,
        concat!("Size of: ", stringify!(BIT_STRING_BITNAME_st))
    );
    assert_eq!(
        ::core::mem::align_of::<BIT_STRING_BITNAME_st>(),
        8usize,
        concat!("Alignment of ", stringify!(BIT_STRING_BITNAME_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<BIT_STRING_BITNAME_st>())).bitnum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BIT_STRING_BITNAME_st),
            "::",
            stringify!(bitnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<BIT_STRING_BITNAME_st>())).lname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BIT_STRING_BITNAME_st),
            "::",
            stringify!(lname)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<BIT_STRING_BITNAME_st>())).sname as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BIT_STRING_BITNAME_st),
            "::",
            stringify!(sname)
        )
    );
}
pub type BIT_STRING_BITNAME = BIT_STRING_BITNAME_st;
extern "C" {
    pub fn ASN1_TYPE_new() -> *mut ASN1_TYPE;
}
extern "C" {
    pub fn ASN1_TYPE_free(a: *mut ASN1_TYPE);
}
extern "C" {
    pub fn d2i_ASN1_TYPE(
        a: *mut *mut ASN1_TYPE,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_TYPE;
}
extern "C" {
    pub fn i2d_ASN1_TYPE(
        a: *mut ASN1_TYPE,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_ANY_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_TYPE_get(a: *const ASN1_TYPE) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_set(
        a: *mut ASN1_TYPE,
        type_: crate::cty::c_int,
        value: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn ASN1_TYPE_set1(
        a: *mut ASN1_TYPE,
        type_: crate::cty::c_int,
        value: *const crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_cmp(a: *const ASN1_TYPE, b: *const ASN1_TYPE) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_pack_sequence(
        it: *const ASN1_ITEM,
        s: *mut crate::cty::c_void,
        t: *mut *mut ASN1_TYPE,
    ) -> *mut ASN1_TYPE;
}
extern "C" {
    pub fn ASN1_TYPE_unpack_sequence(
        it: *const ASN1_ITEM,
        t: *const ASN1_TYPE,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_OBJECT_new() -> *mut ASN1_OBJECT;
}
extern "C" {
    pub fn ASN1_OBJECT_free(a: *mut ASN1_OBJECT);
}
extern "C" {
    pub fn i2d_ASN1_OBJECT(
        a: *const ASN1_OBJECT,
        pp: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn d2i_ASN1_OBJECT(
        a: *mut *mut ASN1_OBJECT,
        pp: *mut *const crate::cty::c_uchar,
        length: crate::cty::c_long,
    ) -> *mut ASN1_OBJECT;
}
extern "C" {
    pub static ASN1_OBJECT_it: ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_OBJECT {
    _unused: [u8; 0],
}
pub type sk_ASN1_OBJECT_compfunc = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_OBJECT,
        b: *const *const ASN1_OBJECT,
    ) -> crate::cty::c_int,
>;
pub type sk_ASN1_OBJECT_freefunc =
    ::core::option::Option<unsafe extern "C" fn(a: *mut ASN1_OBJECT)>;
pub type sk_ASN1_OBJECT_copyfunc =
    ::core::option::Option<unsafe extern "C" fn(a: *const ASN1_OBJECT) -> *mut ASN1_OBJECT>;
extern "C" {
    pub fn ASN1_STRING_new() -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_STRING_free(a: *mut ASN1_STRING);
}
extern "C" {
    pub fn ASN1_STRING_clear_free(a: *mut ASN1_STRING);
}
extern "C" {
    pub fn ASN1_STRING_copy(dst: *mut ASN1_STRING, str_: *const ASN1_STRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_dup(a: *const ASN1_STRING) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_STRING_type_new(type_: crate::cty::c_int) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_STRING_cmp(a: *const ASN1_STRING, b: *const ASN1_STRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_set(
        str_: *mut ASN1_STRING,
        data: *const crate::cty::c_void,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_set0(
        str_: *mut ASN1_STRING,
        data: *mut crate::cty::c_void,
        len: crate::cty::c_int,
    );
}
extern "C" {
    pub fn ASN1_STRING_length(x: *const ASN1_STRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_length_set(x: *mut ASN1_STRING, n: crate::cty::c_int);
}
extern "C" {
    pub fn ASN1_STRING_type(x: *const ASN1_STRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_data(x: *mut ASN1_STRING) -> *mut crate::cty::c_uchar;
}
extern "C" {
    pub fn ASN1_STRING_get0_data(x: *const ASN1_STRING) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn ASN1_BIT_STRING_new() -> *mut ASN1_BIT_STRING;
}
extern "C" {
    pub fn ASN1_BIT_STRING_free(a: *mut ASN1_BIT_STRING);
}
extern "C" {
    pub fn d2i_ASN1_BIT_STRING(
        a: *mut *mut ASN1_BIT_STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_BIT_STRING;
}
extern "C" {
    pub fn i2d_ASN1_BIT_STRING(
        a: *mut ASN1_BIT_STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_BIT_STRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_BIT_STRING_set(
        a: *mut ASN1_BIT_STRING,
        d: *mut crate::cty::c_uchar,
        length: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_set_bit(
        a: *mut ASN1_BIT_STRING,
        n: crate::cty::c_int,
        value: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_get_bit(
        a: *const ASN1_BIT_STRING,
        n: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_check(
        a: *const ASN1_BIT_STRING,
        flags: *const crate::cty::c_uchar,
        flags_len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_name_print(
        out: *mut BIO,
        bs: *mut ASN1_BIT_STRING,
        tbl: *mut BIT_STRING_BITNAME,
        indent: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_num_asc(
        name: *const crate::cty::c_char,
        tbl: *mut BIT_STRING_BITNAME,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_BIT_STRING_set_asc(
        bs: *mut ASN1_BIT_STRING,
        name: *const crate::cty::c_char,
        value: crate::cty::c_int,
        tbl: *mut BIT_STRING_BITNAME,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_new() -> *mut ASN1_INTEGER;
}
extern "C" {
    pub fn ASN1_INTEGER_free(a: *mut ASN1_INTEGER);
}
extern "C" {
    pub fn d2i_ASN1_INTEGER(
        a: *mut *mut ASN1_INTEGER,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_INTEGER;
}
extern "C" {
    pub fn i2d_ASN1_INTEGER(
        a: *mut ASN1_INTEGER,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_INTEGER_it: ASN1_ITEM;
}
extern "C" {
    pub fn d2i_ASN1_UINTEGER(
        a: *mut *mut ASN1_INTEGER,
        pp: *mut *const crate::cty::c_uchar,
        length: crate::cty::c_long,
    ) -> *mut ASN1_INTEGER;
}
extern "C" {
    pub fn ASN1_INTEGER_dup(x: *const ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
extern "C" {
    pub fn ASN1_INTEGER_cmp(x: *const ASN1_INTEGER, y: *const ASN1_INTEGER) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_ENUMERATED_new() -> *mut ASN1_ENUMERATED;
}
extern "C" {
    pub fn ASN1_ENUMERATED_free(a: *mut ASN1_ENUMERATED);
}
extern "C" {
    pub fn d2i_ASN1_ENUMERATED(
        a: *mut *mut ASN1_ENUMERATED,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_ENUMERATED;
}
extern "C" {
    pub fn i2d_ASN1_ENUMERATED(
        a: *mut ASN1_ENUMERATED,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_ENUMERATED_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_UTCTIME_check(a: *const ASN1_UTCTIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_UTCTIME_set(s: *mut ASN1_UTCTIME, t: time_t) -> *mut ASN1_UTCTIME;
}
extern "C" {
    pub fn ASN1_UTCTIME_adj(
        s: *mut ASN1_UTCTIME,
        t: time_t,
        offset_day: crate::cty::c_int,
        offset_sec: crate::cty::c_long,
    ) -> *mut ASN1_UTCTIME;
}
extern "C" {
    pub fn ASN1_UTCTIME_set_string(
        s: *mut ASN1_UTCTIME,
        str_: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_UTCTIME_cmp_time_t(s: *const ASN1_UTCTIME, t: time_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_check(a: *const ASN1_GENERALIZEDTIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set(
        s: *mut ASN1_GENERALIZEDTIME,
        t: time_t,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_adj(
        s: *mut ASN1_GENERALIZEDTIME,
        t: time_t,
        offset_day: crate::cty::c_int,
        offset_sec: crate::cty::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set_string(
        s: *mut ASN1_GENERALIZEDTIME,
        str_: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_diff(
        pday: *mut crate::cty::c_int,
        psec: *mut crate::cty::c_int,
        from: *const ASN1_TIME,
        to: *const ASN1_TIME,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_OCTET_STRING_new() -> *mut ASN1_OCTET_STRING;
}
extern "C" {
    pub fn ASN1_OCTET_STRING_free(a: *mut ASN1_OCTET_STRING);
}
extern "C" {
    pub fn d2i_ASN1_OCTET_STRING(
        a: *mut *mut ASN1_OCTET_STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_OCTET_STRING;
}
extern "C" {
    pub fn i2d_ASN1_OCTET_STRING(
        a: *mut ASN1_OCTET_STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_OCTET_STRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_OCTET_STRING_dup(a: *const ASN1_OCTET_STRING) -> *mut ASN1_OCTET_STRING;
}
extern "C" {
    pub fn ASN1_OCTET_STRING_cmp(
        a: *const ASN1_OCTET_STRING,
        b: *const ASN1_OCTET_STRING,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_OCTET_STRING_set(
        str_: *mut ASN1_OCTET_STRING,
        data: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_VISIBLESTRING_new() -> *mut ASN1_VISIBLESTRING;
}
extern "C" {
    pub fn ASN1_VISIBLESTRING_free(a: *mut ASN1_VISIBLESTRING);
}
extern "C" {
    pub fn d2i_ASN1_VISIBLESTRING(
        a: *mut *mut ASN1_VISIBLESTRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_VISIBLESTRING;
}
extern "C" {
    pub fn i2d_ASN1_VISIBLESTRING(
        a: *mut ASN1_VISIBLESTRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_VISIBLESTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_UNIVERSALSTRING_new() -> *mut ASN1_UNIVERSALSTRING;
}
extern "C" {
    pub fn ASN1_UNIVERSALSTRING_free(a: *mut ASN1_UNIVERSALSTRING);
}
extern "C" {
    pub fn d2i_ASN1_UNIVERSALSTRING(
        a: *mut *mut ASN1_UNIVERSALSTRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_UNIVERSALSTRING;
}
extern "C" {
    pub fn i2d_ASN1_UNIVERSALSTRING(
        a: *mut ASN1_UNIVERSALSTRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_UNIVERSALSTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_UTF8STRING_new() -> *mut ASN1_UTF8STRING;
}
extern "C" {
    pub fn ASN1_UTF8STRING_free(a: *mut ASN1_UTF8STRING);
}
extern "C" {
    pub fn d2i_ASN1_UTF8STRING(
        a: *mut *mut ASN1_UTF8STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_UTF8STRING;
}
extern "C" {
    pub fn i2d_ASN1_UTF8STRING(
        a: *mut ASN1_UTF8STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_UTF8STRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_NULL_new() -> *mut ASN1_NULL;
}
extern "C" {
    pub fn ASN1_NULL_free(a: *mut ASN1_NULL);
}
extern "C" {
    pub fn d2i_ASN1_NULL(
        a: *mut *mut ASN1_NULL,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_NULL;
}
extern "C" {
    pub fn i2d_ASN1_NULL(
        a: *mut ASN1_NULL,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_NULL_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_BMPSTRING_new() -> *mut ASN1_BMPSTRING;
}
extern "C" {
    pub fn ASN1_BMPSTRING_free(a: *mut ASN1_BMPSTRING);
}
extern "C" {
    pub fn d2i_ASN1_BMPSTRING(
        a: *mut *mut ASN1_BMPSTRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_BMPSTRING;
}
extern "C" {
    pub fn i2d_ASN1_BMPSTRING(
        a: *mut ASN1_BMPSTRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_BMPSTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn UTF8_getc(
        str_: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        val: *mut crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn UTF8_putc(
        str_: *mut crate::cty::c_uchar,
        len: crate::cty::c_int,
        value: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_PRINTABLE_new() -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_PRINTABLE_free(a: *mut ASN1_STRING);
}
extern "C" {
    pub fn d2i_ASN1_PRINTABLE(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn i2d_ASN1_PRINTABLE(
        a: *mut ASN1_STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_PRINTABLE_it: ASN1_ITEM;
}
extern "C" {
    pub fn DIRECTORYSTRING_new() -> *mut ASN1_STRING;
}
extern "C" {
    pub fn DIRECTORYSTRING_free(a: *mut ASN1_STRING);
}
extern "C" {
    pub fn d2i_DIRECTORYSTRING(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn i2d_DIRECTORYSTRING(
        a: *mut ASN1_STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static DIRECTORYSTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn DISPLAYTEXT_new() -> *mut ASN1_STRING;
}
extern "C" {
    pub fn DISPLAYTEXT_free(a: *mut ASN1_STRING);
}
extern "C" {
    pub fn d2i_DISPLAYTEXT(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn i2d_DISPLAYTEXT(
        a: *mut ASN1_STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static DISPLAYTEXT_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_PRINTABLESTRING_new() -> *mut ASN1_PRINTABLESTRING;
}
extern "C" {
    pub fn ASN1_PRINTABLESTRING_free(a: *mut ASN1_PRINTABLESTRING);
}
extern "C" {
    pub fn d2i_ASN1_PRINTABLESTRING(
        a: *mut *mut ASN1_PRINTABLESTRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_PRINTABLESTRING;
}
extern "C" {
    pub fn i2d_ASN1_PRINTABLESTRING(
        a: *mut ASN1_PRINTABLESTRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_PRINTABLESTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_T61STRING_new() -> *mut ASN1_T61STRING;
}
extern "C" {
    pub fn ASN1_T61STRING_free(a: *mut ASN1_T61STRING);
}
extern "C" {
    pub fn d2i_ASN1_T61STRING(
        a: *mut *mut ASN1_T61STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_T61STRING;
}
extern "C" {
    pub fn i2d_ASN1_T61STRING(
        a: *mut ASN1_T61STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_T61STRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_IA5STRING_new() -> *mut ASN1_IA5STRING;
}
extern "C" {
    pub fn ASN1_IA5STRING_free(a: *mut ASN1_IA5STRING);
}
extern "C" {
    pub fn d2i_ASN1_IA5STRING(
        a: *mut *mut ASN1_IA5STRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_IA5STRING;
}
extern "C" {
    pub fn i2d_ASN1_IA5STRING(
        a: *mut ASN1_IA5STRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_IA5STRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_GENERALSTRING_new() -> *mut ASN1_GENERALSTRING;
}
extern "C" {
    pub fn ASN1_GENERALSTRING_free(a: *mut ASN1_GENERALSTRING);
}
extern "C" {
    pub fn d2i_ASN1_GENERALSTRING(
        a: *mut *mut ASN1_GENERALSTRING,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_GENERALSTRING;
}
extern "C" {
    pub fn i2d_ASN1_GENERALSTRING(
        a: *mut ASN1_GENERALSTRING,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_GENERALSTRING_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_UTCTIME_new() -> *mut ASN1_UTCTIME;
}
extern "C" {
    pub fn ASN1_UTCTIME_free(a: *mut ASN1_UTCTIME);
}
extern "C" {
    pub fn d2i_ASN1_UTCTIME(
        a: *mut *mut ASN1_UTCTIME,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_UTCTIME;
}
extern "C" {
    pub fn i2d_ASN1_UTCTIME(
        a: *mut ASN1_UTCTIME,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_UTCTIME_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_new() -> *mut ASN1_GENERALIZEDTIME;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_free(a: *mut ASN1_GENERALIZEDTIME);
}
extern "C" {
    pub fn d2i_ASN1_GENERALIZEDTIME(
        a: *mut *mut ASN1_GENERALIZEDTIME,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
extern "C" {
    pub fn i2d_ASN1_GENERALIZEDTIME(
        a: *mut ASN1_GENERALIZEDTIME,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_GENERALIZEDTIME_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_TIME_new() -> *mut ASN1_TIME;
}
extern "C" {
    pub fn ASN1_TIME_free(a: *mut ASN1_TIME);
}
extern "C" {
    pub fn d2i_ASN1_TIME(
        a: *mut *mut ASN1_TIME,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> *mut ASN1_TIME;
}
extern "C" {
    pub fn i2d_ASN1_TIME(
        a: *mut ASN1_TIME,
        out: *mut *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub static ASN1_TIME_it: ASN1_ITEM;
}
extern "C" {
    pub static ASN1_OCTET_STRING_NDEF_it: ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_TIME_set(s: *mut ASN1_TIME, t: time_t) -> *mut ASN1_TIME;
}
extern "C" {
    pub fn ASN1_TIME_adj(
        s: *mut ASN1_TIME,
        t: time_t,
        offset_day: crate::cty::c_int,
        offset_sec: crate::cty::c_long,
    ) -> *mut ASN1_TIME;
}
extern "C" {
    pub fn ASN1_TIME_check(t: *const ASN1_TIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_to_generalizedtime(
        t: *const ASN1_TIME,
        out: *mut *mut ASN1_GENERALIZEDTIME,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
extern "C" {
    pub fn ASN1_TIME_set_string(
        s: *mut ASN1_TIME,
        str_: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_set_string_X509(
        s: *mut ASN1_TIME,
        str_: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_to_tm(s: *const ASN1_TIME, tm: *mut tm) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_normalize(s: *mut ASN1_TIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_cmp_time_t(s: *const ASN1_TIME, t: time_t) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_compare(a: *const ASN1_TIME, b: *const ASN1_TIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn i2a_ASN1_INTEGER(bp: *mut BIO, a: *const ASN1_INTEGER) -> crate::cty::c_int;
}
extern "C" {
    pub fn a2i_ASN1_INTEGER(
        bp: *mut BIO,
        bs: *mut ASN1_INTEGER,
        buf: *mut crate::cty::c_char,
        size: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn i2a_ASN1_ENUMERATED(bp: *mut BIO, a: *const ASN1_ENUMERATED) -> crate::cty::c_int;
}
extern "C" {
    pub fn a2i_ASN1_ENUMERATED(
        bp: *mut BIO,
        bs: *mut ASN1_ENUMERATED,
        buf: *mut crate::cty::c_char,
        size: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn i2a_ASN1_OBJECT(bp: *mut BIO, a: *const ASN1_OBJECT) -> crate::cty::c_int;
}
extern "C" {
    pub fn a2i_ASN1_STRING(
        bp: *mut BIO,
        bs: *mut ASN1_STRING,
        buf: *mut crate::cty::c_char,
        size: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn i2a_ASN1_STRING(
        bp: *mut BIO,
        a: *const ASN1_STRING,
        type_: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn i2t_ASN1_OBJECT(
        buf: *mut crate::cty::c_char,
        buf_len: crate::cty::c_int,
        a: *const ASN1_OBJECT,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn a2d_ASN1_OBJECT(
        out: *mut crate::cty::c_uchar,
        olen: crate::cty::c_int,
        buf: *const crate::cty::c_char,
        num: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_OBJECT_create(
        nid: crate::cty::c_int,
        data: *mut crate::cty::c_uchar,
        len: crate::cty::c_int,
        sn: *const crate::cty::c_char,
        ln: *const crate::cty::c_char,
    ) -> *mut ASN1_OBJECT;
}
extern "C" {
    pub fn ASN1_INTEGER_get_int64(pr: *mut i64, a: *const ASN1_INTEGER) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_set_int64(a: *mut ASN1_INTEGER, r: i64) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_get_uint64(pr: *mut u64, a: *const ASN1_INTEGER) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_set_uint64(a: *mut ASN1_INTEGER, r: u64) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_set(a: *mut ASN1_INTEGER, v: crate::cty::c_long) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_INTEGER_get(a: *const ASN1_INTEGER) -> crate::cty::c_long;
}
extern "C" {
    pub fn BN_to_ASN1_INTEGER(bn: *const BIGNUM, ai: *mut ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
extern "C" {
    pub fn ASN1_INTEGER_to_BN(ai: *const ASN1_INTEGER, bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn ASN1_ENUMERATED_get_int64(pr: *mut i64, a: *const ASN1_ENUMERATED) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_ENUMERATED_set_int64(a: *mut ASN1_ENUMERATED, r: i64) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_ENUMERATED_set(a: *mut ASN1_ENUMERATED, v: crate::cty::c_long)
        -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_ENUMERATED_get(a: *const ASN1_ENUMERATED) -> crate::cty::c_long;
}
extern "C" {
    pub fn BN_to_ASN1_ENUMERATED(
        bn: *const BIGNUM,
        ai: *mut ASN1_ENUMERATED,
    ) -> *mut ASN1_ENUMERATED;
}
extern "C" {
    pub fn ASN1_ENUMERATED_to_BN(ai: *const ASN1_ENUMERATED, bn: *mut BIGNUM) -> *mut BIGNUM;
}
extern "C" {
    pub fn ASN1_PRINTABLE_type(
        s: *const crate::cty::c_uchar,
        max: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_tag2bit(tag: crate::cty::c_int) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_get_object(
        pp: *mut *const crate::cty::c_uchar,
        plength: *mut crate::cty::c_long,
        ptag: *mut crate::cty::c_int,
        pclass: *mut crate::cty::c_int,
        omax: crate::cty::c_long,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_check_infinite_end(
        p: *mut *mut crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_const_check_infinite_end(
        p: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_put_object(
        pp: *mut *mut crate::cty::c_uchar,
        constructed: crate::cty::c_int,
        length: crate::cty::c_int,
        tag: crate::cty::c_int,
        xclass: crate::cty::c_int,
    );
}
extern "C" {
    pub fn ASN1_put_eoc(pp: *mut *mut crate::cty::c_uchar) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_object_size(
        constructed: crate::cty::c_int,
        length: crate::cty::c_int,
        tag: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_dup(
        i2d: i2d_of_void,
        d2i: d2i_of_void,
        x: *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_item_dup(
        it: *const ASN1_ITEM,
        x: *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_d2i_fp(
        xnew: ::core::option::Option<unsafe extern "C" fn() -> *mut crate::cty::c_void>,
        d2i: d2i_of_void,
        in_: *mut FILE,
        x: *mut *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_item_d2i_fp(
        it: *const ASN1_ITEM,
        in_: *mut FILE,
        x: *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_i2d_fp(
        i2d: i2d_of_void,
        out: *mut FILE,
        x: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_item_i2d_fp(
        it: *const ASN1_ITEM,
        out: *mut FILE,
        x: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_print_ex_fp(
        fp: *mut FILE,
        str_: *const ASN1_STRING,
        flags: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_to_UTF8(
        out: *mut *mut crate::cty::c_uchar,
        in_: *const ASN1_STRING,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_d2i_bio(
        xnew: ::core::option::Option<unsafe extern "C" fn() -> *mut crate::cty::c_void>,
        d2i: d2i_of_void,
        in_: *mut BIO,
        x: *mut *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_item_d2i_bio(
        it: *const ASN1_ITEM,
        in_: *mut BIO,
        x: *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_i2d_bio(
        i2d: i2d_of_void,
        out: *mut BIO,
        x: *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_item_i2d_bio(
        it: *const ASN1_ITEM,
        out: *mut BIO,
        x: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_UTCTIME_print(fp: *mut BIO, a: *const ASN1_UTCTIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_GENERALIZEDTIME_print(
        fp: *mut BIO,
        a: *const ASN1_GENERALIZEDTIME,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TIME_print(fp: *mut BIO, a: *const ASN1_TIME) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_print(bp: *mut BIO, v: *const ASN1_STRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_print_ex(
        out: *mut BIO,
        str_: *const ASN1_STRING,
        flags: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_buf_print(
        bp: *mut BIO,
        buf: *const crate::cty::c_uchar,
        buflen: size_t,
        off: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_bn_print(
        bp: *mut BIO,
        number: *const crate::cty::c_char,
        num: *const BIGNUM,
        buf: *mut crate::cty::c_uchar,
        off: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_parse(
        bp: *mut BIO,
        pp: *const crate::cty::c_uchar,
        len: crate::cty::c_long,
        indent: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_parse_dump(
        bp: *mut BIO,
        pp: *const crate::cty::c_uchar,
        len: crate::cty::c_long,
        indent: crate::cty::c_int,
        dump: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_tag2str(tag: crate::cty::c_int) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn ASN1_UNIVERSALSTRING_to_string(s: *mut ASN1_UNIVERSALSTRING) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_set_octetstring(
        a: *mut ASN1_TYPE,
        data: *mut crate::cty::c_uchar,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_get_octetstring(
        a: *const ASN1_TYPE,
        data: *mut crate::cty::c_uchar,
        max_len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_set_int_octetstring(
        a: *mut ASN1_TYPE,
        num: crate::cty::c_long,
        data: *mut crate::cty::c_uchar,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_TYPE_get_int_octetstring(
        a: *const ASN1_TYPE,
        num: *mut crate::cty::c_long,
        data: *mut crate::cty::c_uchar,
        max_len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_item_unpack(
        oct: *const ASN1_STRING,
        it: *const ASN1_ITEM,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn ASN1_item_pack(
        obj: *mut crate::cty::c_void,
        it: *const ASN1_ITEM,
        oct: *mut *mut ASN1_OCTET_STRING,
    ) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_STRING_set_default_mask(mask: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_STRING_set_default_mask_asc(p: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_get_default_mask() -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_mbstring_copy(
        out: *mut *mut ASN1_STRING,
        in_: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        inform: crate::cty::c_int,
        mask: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_mbstring_ncopy(
        out: *mut *mut ASN1_STRING,
        in_: *const crate::cty::c_uchar,
        len: crate::cty::c_int,
        inform: crate::cty::c_int,
        mask: crate::cty::c_ulong,
        minsize: crate::cty::c_long,
        maxsize: crate::cty::c_long,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_set_by_NID(
        out: *mut *mut ASN1_STRING,
        in_: *const crate::cty::c_uchar,
        inlen: crate::cty::c_int,
        inform: crate::cty::c_int,
        nid: crate::cty::c_int,
    ) -> *mut ASN1_STRING;
}
extern "C" {
    pub fn ASN1_STRING_TABLE_get(nid: crate::cty::c_int) -> *mut ASN1_STRING_TABLE;
}
extern "C" {
    pub fn ASN1_STRING_TABLE_add(
        arg1: crate::cty::c_int,
        arg2: crate::cty::c_long,
        arg3: crate::cty::c_long,
        arg4: crate::cty::c_ulong,
        arg5: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_STRING_TABLE_cleanup();
}
extern "C" {
    pub fn ASN1_item_new(it: *const ASN1_ITEM) -> *mut ASN1_VALUE;
}
extern "C" {
    pub fn ASN1_item_free(val: *mut ASN1_VALUE, it: *const ASN1_ITEM);
}
extern "C" {
    pub fn ASN1_item_d2i(
        val: *mut *mut ASN1_VALUE,
        in_: *mut *const crate::cty::c_uchar,
        len: crate::cty::c_long,
        it: *const ASN1_ITEM,
    ) -> *mut ASN1_VALUE;
}
extern "C" {
    pub fn ASN1_item_i2d(
        val: *mut ASN1_VALUE,
        out: *mut *mut crate::cty::c_uchar,
        it: *const ASN1_ITEM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_item_ndef_i2d(
        val: *mut ASN1_VALUE,
        out: *mut *mut crate::cty::c_uchar,
        it: *const ASN1_ITEM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_add_oid_module();
}
extern "C" {
    pub fn ASN1_add_stable_module();
}
extern "C" {
    pub fn ASN1_generate_nconf(str_: *const crate::cty::c_char, nconf: *mut CONF)
        -> *mut ASN1_TYPE;
}
extern "C" {
    pub fn ASN1_generate_v3(
        str_: *const crate::cty::c_char,
        cnf: *mut X509V3_CTX,
    ) -> *mut ASN1_TYPE;
}
extern "C" {
    pub fn ASN1_str2mask(
        str_: *const crate::cty::c_char,
        pmask: *mut crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_item_print(
        out: *mut BIO,
        ifld: *mut ASN1_VALUE,
        indent: crate::cty::c_int,
        it: *const ASN1_ITEM,
        pctx: *const ASN1_PCTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_PCTX_new() -> *mut ASN1_PCTX;
}
extern "C" {
    pub fn ASN1_PCTX_free(p: *mut ASN1_PCTX);
}
extern "C" {
    pub fn ASN1_PCTX_get_flags(p: *const ASN1_PCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_PCTX_set_flags(p: *mut ASN1_PCTX, flags: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_PCTX_get_nm_flags(p: *const ASN1_PCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_PCTX_set_nm_flags(p: *mut ASN1_PCTX, flags: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_PCTX_get_cert_flags(p: *const ASN1_PCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_PCTX_set_cert_flags(p: *mut ASN1_PCTX, flags: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_PCTX_get_oid_flags(p: *const ASN1_PCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_PCTX_set_oid_flags(p: *mut ASN1_PCTX, flags: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_PCTX_get_str_flags(p: *const ASN1_PCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_PCTX_set_str_flags(p: *mut ASN1_PCTX, flags: crate::cty::c_ulong);
}
extern "C" {
    pub fn ASN1_SCTX_new(
        scan_cb: ::core::option::Option<
            unsafe extern "C" fn(ctx: *mut ASN1_SCTX) -> crate::cty::c_int,
        >,
    ) -> *mut ASN1_SCTX;
}
extern "C" {
    pub fn ASN1_SCTX_free(p: *mut ASN1_SCTX);
}
extern "C" {
    pub fn ASN1_SCTX_get_item(p: *mut ASN1_SCTX) -> *const ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_SCTX_get_template(p: *mut ASN1_SCTX) -> *const ASN1_TEMPLATE;
}
extern "C" {
    pub fn ASN1_SCTX_get_flags(p: *mut ASN1_SCTX) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn ASN1_SCTX_set_app_data(p: *mut ASN1_SCTX, data: *mut crate::cty::c_void);
}
extern "C" {
    pub fn ASN1_SCTX_get_app_data(p: *mut ASN1_SCTX) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn BIO_f_asn1() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_new_NDEF(out: *mut BIO, val: *mut ASN1_VALUE, it: *const ASN1_ITEM) -> *mut BIO;
}
extern "C" {
    pub fn i2d_ASN1_bio_stream(
        out: *mut BIO,
        val: *mut ASN1_VALUE,
        in_: *mut BIO,
        flags: crate::cty::c_int,
        it: *const ASN1_ITEM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn PEM_write_bio_ASN1_stream(
        out: *mut BIO,
        val: *mut ASN1_VALUE,
        in_: *mut BIO,
        flags: crate::cty::c_int,
        hdr: *const crate::cty::c_char,
        it: *const ASN1_ITEM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn SMIME_write_ASN1(
        bio: *mut BIO,
        val: *mut ASN1_VALUE,
        data: *mut BIO,
        flags: crate::cty::c_int,
        ctype_nid: crate::cty::c_int,
        econt_nid: crate::cty::c_int,
        mdalgs: *mut stack_st_X509_ALGOR,
        it: *const ASN1_ITEM,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn SMIME_read_ASN1(
        bio: *mut BIO,
        bcont: *mut *mut BIO,
        it: *const ASN1_ITEM,
    ) -> *mut ASN1_VALUE;
}
extern "C" {
    pub fn SMIME_crlf_copy(
        in_: *mut BIO,
        out: *mut BIO,
        flags: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn SMIME_text(in_: *mut BIO, out: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn ASN1_ITEM_lookup(name: *const crate::cty::c_char) -> *const ASN1_ITEM;
}
extern "C" {
    pub fn ASN1_ITEM_get(i: size_t) -> *const ASN1_ITEM;
}
extern "C" {
    pub fn ERR_load_OBJ_strings() -> crate::cty::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obj_name_st {
    pub type_: crate::cty::c_int,
    pub alias: crate::cty::c_int,
    pub name: *const crate::cty::c_char,
    pub data: *const crate::cty::c_char,
}
#[test]
fn bindgen_test_layout_obj_name_st() {
    assert_eq!(
        ::core::mem::size_of::<obj_name_st>(),
        24usize,
        concat!("Size of: ", stringify!(obj_name_st))
    );
    assert_eq!(
        ::core::mem::align_of::<obj_name_st>(),
        8usize,
        concat!("Alignment of ", stringify!(obj_name_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<obj_name_st>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(obj_name_st),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<obj_name_st>())).alias as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(obj_name_st),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<obj_name_st>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(obj_name_st),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<obj_name_st>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(obj_name_st),
            "::",
            stringify!(data)
        )
    );
}
pub type OBJ_NAME = obj_name_st;
extern "C" {
    pub fn OBJ_NAME_init() -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_NAME_new_index(
        hash_func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *const crate::cty::c_char) -> crate::cty::c_ulong,
        >,
        cmp_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const crate::cty::c_char,
                arg2: *const crate::cty::c_char,
            ) -> crate::cty::c_int,
        >,
        free_func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const crate::cty::c_char,
                arg2: crate::cty::c_int,
                arg3: *const crate::cty::c_char,
            ),
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_NAME_get(
        name: *const crate::cty::c_char,
        type_: crate::cty::c_int,
    ) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn OBJ_NAME_add(
        name: *const crate::cty::c_char,
        type_: crate::cty::c_int,
        data: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_NAME_remove(
        name: *const crate::cty::c_char,
        type_: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_NAME_cleanup(type_: crate::cty::c_int);
}
extern "C" {
    pub fn OBJ_NAME_do_all(
        type_: crate::cty::c_int,
        fn_: ::core::option::Option<
            unsafe extern "C" fn(arg1: *const OBJ_NAME, arg: *mut crate::cty::c_void),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn OBJ_NAME_do_all_sorted(
        type_: crate::cty::c_int,
        fn_: ::core::option::Option<
            unsafe extern "C" fn(arg1: *const OBJ_NAME, arg: *mut crate::cty::c_void),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn OBJ_dup(o: *const ASN1_OBJECT) -> *mut ASN1_OBJECT;
}
extern "C" {
    pub fn OBJ_nid2obj(n: crate::cty::c_int) -> *mut ASN1_OBJECT;
}
extern "C" {
    pub fn OBJ_nid2ln(n: crate::cty::c_int) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn OBJ_nid2sn(n: crate::cty::c_int) -> *const crate::cty::c_char;
}
extern "C" {
    pub fn OBJ_obj2nid(o: *const ASN1_OBJECT) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_txt2obj(
        s: *const crate::cty::c_char,
        no_name: crate::cty::c_int,
    ) -> *mut ASN1_OBJECT;
}
extern "C" {
    pub fn OBJ_obj2txt(
        buf: *mut crate::cty::c_char,
        buf_len: crate::cty::c_int,
        a: *const ASN1_OBJECT,
        no_name: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_txt2nid(s: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_ln2nid(s: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_sn2nid(s: *const crate::cty::c_char) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_cmp(a: *const ASN1_OBJECT, b: *const ASN1_OBJECT) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_bsearch_(
        key: *const crate::cty::c_void,
        base: *const crate::cty::c_void,
        num: crate::cty::c_int,
        size: crate::cty::c_int,
        cmp: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const crate::cty::c_void,
                arg2: *const crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
    ) -> *const crate::cty::c_void;
}
extern "C" {
    pub fn OBJ_bsearch_ex_(
        key: *const crate::cty::c_void,
        base: *const crate::cty::c_void,
        num: crate::cty::c_int,
        size: crate::cty::c_int,
        cmp: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const crate::cty::c_void,
                arg2: *const crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
        flags: crate::cty::c_int,
    ) -> *const crate::cty::c_void;
}
extern "C" {
    pub fn OBJ_new_nid(num: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_add_object(obj: *const ASN1_OBJECT) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_create(
        oid: *const crate::cty::c_char,
        sn: *const crate::cty::c_char,
        ln: *const crate::cty::c_char,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_create_objects(in_: *mut BIO) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_length(obj: *const ASN1_OBJECT) -> size_t;
}
extern "C" {
    pub fn OBJ_get0_data(obj: *const ASN1_OBJECT) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn OBJ_find_sigid_algs(
        signid: crate::cty::c_int,
        pdig_nid: *mut crate::cty::c_int,
        ppkey_nid: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_find_sigid_by_algs(
        psignid: *mut crate::cty::c_int,
        dig_nid: crate::cty::c_int,
        pkey_nid: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_add_sigid(
        signid: crate::cty::c_int,
        dig_id: crate::cty::c_int,
        pkey_id: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn OBJ_sigid_free();
}
extern "C" {
    pub fn EVP_MD_meth_new(md_type: crate::cty::c_int, pkey_type: crate::cty::c_int)
        -> *mut EVP_MD;
}
extern "C" {
    pub fn EVP_MD_meth_dup(md: *const EVP_MD) -> *mut EVP_MD;
}
extern "C" {
    pub fn EVP_MD_meth_free(md: *mut EVP_MD);
}
extern "C" {
    pub fn EVP_MD_meth_set_input_blocksize(
        md: *mut EVP_MD,
        blocksize: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_result_size(
        md: *mut EVP_MD,
        resultsize: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_app_datasize(
        md: *mut EVP_MD,
        datasize: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_flags(md: *mut EVP_MD, flags: crate::cty::c_ulong) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_init(
        md: *mut EVP_MD,
        init: ::core::option::Option<
            unsafe extern "C" fn(ctx: *mut EVP_MD_CTX) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_update(
        md: *mut EVP_MD,
        update: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_MD_CTX,
                data: *const crate::cty::c_void,
                count: size_t,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_final(
        md: *mut EVP_MD,
        final_: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_MD_CTX,
                md: *mut crate::cty::c_uchar,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_copy(
        md: *mut EVP_MD,
        copy: ::core::option::Option<
            unsafe extern "C" fn(to: *mut EVP_MD_CTX, from: *const EVP_MD_CTX) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_cleanup(
        md: *mut EVP_MD,
        cleanup: ::core::option::Option<
            unsafe extern "C" fn(ctx: *mut EVP_MD_CTX) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_set_ctrl(
        md: *mut EVP_MD,
        ctrl: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_MD_CTX,
                cmd: crate::cty::c_int,
                p1: crate::cty::c_int,
                p2: *mut crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_get_input_blocksize(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_get_result_size(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_get_app_datasize(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_meth_get_flags(md: *const EVP_MD) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn EVP_MD_meth_get_init(
        md: *const EVP_MD,
    ) -> ::core::option::Option<unsafe extern "C" fn(md: *mut EVP_MD_CTX) -> crate::cty::c_int>;
}
extern "C" {
    pub fn EVP_MD_meth_get_update(
        md: *const EVP_MD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            md: *mut EVP_MD_CTX,
            arg1: *const crate::cty::c_void,
            arg2: size_t,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_MD_meth_get_final(
        md: *const EVP_MD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            md: *mut EVP_MD_CTX,
            arg1: *mut crate::cty::c_uchar,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_MD_meth_get_copy(
        md: *const EVP_MD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(md: *mut EVP_MD_CTX, arg1: *const EVP_MD_CTX) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_MD_meth_get_cleanup(
        md: *const EVP_MD,
    ) -> ::core::option::Option<unsafe extern "C" fn(md: *mut EVP_MD_CTX) -> crate::cty::c_int>;
}
extern "C" {
    pub fn EVP_MD_meth_get_ctrl(
        md: *const EVP_MD,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            md: *mut EVP_MD_CTX,
            arg1: crate::cty::c_int,
            arg2: crate::cty::c_int,
            arg3: *mut crate::cty::c_void,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_new(
        cipher_type: crate::cty::c_int,
        block_size: crate::cty::c_int,
        key_len: crate::cty::c_int,
    ) -> *mut EVP_CIPHER;
}
extern "C" {
    pub fn EVP_CIPHER_meth_dup(cipher: *const EVP_CIPHER) -> *mut EVP_CIPHER;
}
extern "C" {
    pub fn EVP_CIPHER_meth_free(cipher: *mut EVP_CIPHER);
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_iv_length(
        cipher: *mut EVP_CIPHER,
        iv_len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_flags(
        cipher: *mut EVP_CIPHER,
        flags: crate::cty::c_ulong,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_impl_ctx_size(
        cipher: *mut EVP_CIPHER,
        ctx_size: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_init(
        cipher: *mut EVP_CIPHER,
        init: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_CIPHER_CTX,
                key: *const crate::cty::c_uchar,
                iv: *const crate::cty::c_uchar,
                enc: crate::cty::c_int,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_do_cipher(
        cipher: *mut EVP_CIPHER,
        do_cipher: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_CIPHER_CTX,
                out: *mut crate::cty::c_uchar,
                in_: *const crate::cty::c_uchar,
                inl: size_t,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_cleanup(
        cipher: *mut EVP_CIPHER,
        cleanup: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut EVP_CIPHER_CTX) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_set_asn1_params(
        cipher: *mut EVP_CIPHER,
        set_asn1_parameters: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut EVP_CIPHER_CTX,
                arg2: *mut ASN1_TYPE,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_get_asn1_params(
        cipher: *mut EVP_CIPHER,
        get_asn1_parameters: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut EVP_CIPHER_CTX,
                arg2: *mut ASN1_TYPE,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_set_ctrl(
        cipher: *mut EVP_CIPHER,
        ctrl: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut EVP_CIPHER_CTX,
                type_: crate::cty::c_int,
                arg: crate::cty::c_int,
                ptr: *mut crate::cty::c_void,
            ) -> crate::cty::c_int,
        >,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_init(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            cipher: *mut EVP_CIPHER_CTX,
            arg1: *const crate::cty::c_uchar,
            arg2: *const crate::cty::c_uchar,
            arg3: crate::cty::c_int,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_do_cipher(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            cipher: *mut EVP_CIPHER_CTX,
            arg1: *mut crate::cty::c_uchar,
            arg2: *const crate::cty::c_uchar,
            arg3: size_t,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_cleanup(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(cipher: *mut EVP_CIPHER_CTX) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_set_asn1_params(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            cipher: *mut EVP_CIPHER_CTX,
            arg1: *mut ASN1_TYPE,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_get_asn1_params(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            cipher: *mut EVP_CIPHER_CTX,
            arg1: *mut ASN1_TYPE,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_CIPHER_meth_get_ctrl(
        cipher: *const EVP_CIPHER,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            cipher: *mut EVP_CIPHER_CTX,
            arg1: crate::cty::c_int,
            arg2: crate::cty::c_int,
            arg3: *mut crate::cty::c_void,
        ) -> crate::cty::c_int,
    >;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM {
    pub out: *mut crate::cty::c_uchar,
    pub inp: *const crate::cty::c_uchar,
    pub len: size_t,
    pub interleave: crate::cty::c_uint,
}
#[test]
fn bindgen_test_layout_EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM() {
    assert_eq!(
        ::core::mem::size_of::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>(),
        32usize,
        concat!("Size of: ", stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM))
    );
    assert_eq!(
        ::core::mem::align_of::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>())).out as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM),
            "::",
            stringify!(out)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>())).inp as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM),
            "::",
            stringify!(inp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>())).len as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM>())).interleave as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(EVP_CTRL_TLS1_1_MULTIBLOCK_PARAM),
            "::",
            stringify!(interleave)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_info_st {
    pub cipher: *const EVP_CIPHER,
    pub iv: [crate::cty::c_uchar; 16usize],
}
#[test]
fn bindgen_test_layout_evp_cipher_info_st() {
    assert_eq!(
        ::core::mem::size_of::<evp_cipher_info_st>(),
        24usize,
        concat!("Size of: ", stringify!(evp_cipher_info_st))
    );
    assert_eq!(
        ::core::mem::align_of::<evp_cipher_info_st>(),
        8usize,
        concat!("Alignment of ", stringify!(evp_cipher_info_st))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<evp_cipher_info_st>())).cipher as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evp_cipher_info_st),
            "::",
            stringify!(cipher)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<evp_cipher_info_st>())).iv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evp_cipher_info_st),
            "::",
            stringify!(iv)
        )
    );
}
pub type EVP_CIPHER_INFO = evp_cipher_info_st;
pub type EVP_PBE_KEYGEN = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut EVP_CIPHER_CTX,
        pass: *const crate::cty::c_char,
        passlen: crate::cty::c_int,
        param: *mut ASN1_TYPE,
        cipher: *const EVP_CIPHER,
        md: *const EVP_MD,
        en_de: crate::cty::c_int,
    ) -> crate::cty::c_int,
>;
extern "C" {
    pub fn EVP_MD_type(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_pkey_type(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_size(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_block_size(md: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_flags(md: *const EVP_MD) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn EVP_MD_CTX_md(ctx: *const EVP_MD_CTX) -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_MD_CTX_update_fn(
        ctx: *mut EVP_MD_CTX,
    ) -> ::core::option::Option<
        unsafe extern "C" fn(
            ctx: *mut EVP_MD_CTX,
            arg1: *const crate::cty::c_void,
            arg2: size_t,
        ) -> crate::cty::c_int,
    >;
}
extern "C" {
    pub fn EVP_MD_CTX_set_update_fn(
        ctx: *mut EVP_MD_CTX,
        update: ::core::option::Option<
            unsafe extern "C" fn(
                ctx: *mut EVP_MD_CTX,
                data: *const crate::cty::c_void,
                count: size_t,
            ) -> crate::cty::c_int,
        >,
    );
}
extern "C" {
    pub fn EVP_MD_CTX_pkey_ctx(ctx: *const EVP_MD_CTX) -> *mut EVP_PKEY_CTX;
}
extern "C" {
    pub fn EVP_MD_CTX_set_pkey_ctx(ctx: *mut EVP_MD_CTX, pctx: *mut EVP_PKEY_CTX);
}
extern "C" {
    pub fn EVP_MD_CTX_md_data(ctx: *const EVP_MD_CTX) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn EVP_CIPHER_nid(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_block_size(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_impl_ctx_size(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_key_length(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_iv_length(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_flags(cipher: *const EVP_CIPHER) -> crate::cty::c_ulong;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_cipher(ctx: *const EVP_CIPHER_CTX) -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_encrypting(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_nid(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_block_size(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_key_length(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_iv_length(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_iv(ctx: *const EVP_CIPHER_CTX) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_original_iv(ctx: *const EVP_CIPHER_CTX) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_iv_noconst(ctx: *mut EVP_CIPHER_CTX) -> *mut crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_buf_noconst(ctx: *mut EVP_CIPHER_CTX) -> *mut crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_num(ctx: *const EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_num(ctx: *mut EVP_CIPHER_CTX, num: crate::cty::c_int);
}
extern "C" {
    pub fn EVP_CIPHER_CTX_copy(
        out: *mut EVP_CIPHER_CTX,
        in_: *const EVP_CIPHER_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_get_app_data(ctx: *const EVP_CIPHER_CTX) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_app_data(ctx: *mut EVP_CIPHER_CTX, data: *mut crate::cty::c_void);
}
extern "C" {
    pub fn EVP_CIPHER_CTX_get_cipher_data(ctx: *const EVP_CIPHER_CTX) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_cipher_data(
        ctx: *mut EVP_CIPHER_CTX,
        cipher_data: *mut crate::cty::c_void,
    ) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn EVP_Cipher(
        c: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_uint,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_CTX_ctrl(
        ctx: *mut EVP_MD_CTX,
        cmd: crate::cty::c_int,
        p1: crate::cty::c_int,
        p2: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_CTX_new() -> *mut EVP_MD_CTX;
}
extern "C" {
    pub fn EVP_MD_CTX_reset(ctx: *mut EVP_MD_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_CTX_free(ctx: *mut EVP_MD_CTX);
}
extern "C" {
    pub fn EVP_MD_CTX_copy_ex(out: *mut EVP_MD_CTX, in_: *const EVP_MD_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_CTX_set_flags(ctx: *mut EVP_MD_CTX, flags: crate::cty::c_int);
}
extern "C" {
    pub fn EVP_MD_CTX_clear_flags(ctx: *mut EVP_MD_CTX, flags: crate::cty::c_int);
}
extern "C" {
    pub fn EVP_MD_CTX_test_flags(
        ctx: *const EVP_MD_CTX,
        flags: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestInit_ex(
        ctx: *mut EVP_MD_CTX,
        type_: *const EVP_MD,
        impl_: *mut ENGINE,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestUpdate(
        ctx: *mut EVP_MD_CTX,
        d: *const crate::cty::c_void,
        cnt: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestFinal_ex(
        ctx: *mut EVP_MD_CTX,
        md: *mut crate::cty::c_uchar,
        s: *mut crate::cty::c_uint,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_Digest(
        data: *const crate::cty::c_void,
        count: size_t,
        md: *mut crate::cty::c_uchar,
        size: *mut crate::cty::c_uint,
        type_: *const EVP_MD,
        impl_: *mut ENGINE,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_MD_CTX_copy(out: *mut EVP_MD_CTX, in_: *const EVP_MD_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestInit(ctx: *mut EVP_MD_CTX, type_: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestFinal(
        ctx: *mut EVP_MD_CTX,
        md: *mut crate::cty::c_uchar,
        s: *mut crate::cty::c_uint,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestFinalXOF(
        ctx: *mut EVP_MD_CTX,
        md: *mut crate::cty::c_uchar,
        len: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_read_pw_string(
        buf: *mut crate::cty::c_char,
        length: crate::cty::c_int,
        prompt: *const crate::cty::c_char,
        verify: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_read_pw_string_min(
        buf: *mut crate::cty::c_char,
        minlen: crate::cty::c_int,
        maxlen: crate::cty::c_int,
        prompt: *const crate::cty::c_char,
        verify: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_set_pw_prompt(prompt: *const crate::cty::c_char);
}
extern "C" {
    pub fn EVP_get_pw_prompt() -> *mut crate::cty::c_char;
}
extern "C" {
    pub fn EVP_BytesToKey(
        type_: *const EVP_CIPHER,
        md: *const EVP_MD,
        salt: *const crate::cty::c_uchar,
        data: *const crate::cty::c_uchar,
        datal: crate::cty::c_int,
        count: crate::cty::c_int,
        key: *mut crate::cty::c_uchar,
        iv: *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_flags(ctx: *mut EVP_CIPHER_CTX, flags: crate::cty::c_int);
}
extern "C" {
    pub fn EVP_CIPHER_CTX_clear_flags(ctx: *mut EVP_CIPHER_CTX, flags: crate::cty::c_int);
}
extern "C" {
    pub fn EVP_CIPHER_CTX_test_flags(
        ctx: *const EVP_CIPHER_CTX,
        flags: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncryptInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncryptInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        impl_: *mut ENGINE,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncryptUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncryptFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncryptFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecryptInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecryptInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        impl_: *mut ENGINE,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecryptUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecryptFinal(
        ctx: *mut EVP_CIPHER_CTX,
        outm: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecryptFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        outm: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CipherInit(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
        enc: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CipherInit_ex(
        ctx: *mut EVP_CIPHER_CTX,
        cipher: *const EVP_CIPHER,
        impl_: *mut ENGINE,
        key: *const crate::cty::c_uchar,
        iv: *const crate::cty::c_uchar,
        enc: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CipherUpdate(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CipherFinal(
        ctx: *mut EVP_CIPHER_CTX,
        outm: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CipherFinal_ex(
        ctx: *mut EVP_CIPHER_CTX,
        outm: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_SignFinal(
        ctx: *mut EVP_MD_CTX,
        md: *mut crate::cty::c_uchar,
        s: *mut crate::cty::c_uint,
        pkey: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestSign(
        ctx: *mut EVP_MD_CTX,
        sigret: *mut crate::cty::c_uchar,
        siglen: *mut size_t,
        tbs: *const crate::cty::c_uchar,
        tbslen: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_VerifyFinal(
        ctx: *mut EVP_MD_CTX,
        sigbuf: *const crate::cty::c_uchar,
        siglen: crate::cty::c_uint,
        pkey: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestVerify(
        ctx: *mut EVP_MD_CTX,
        sigret: *const crate::cty::c_uchar,
        siglen: size_t,
        tbs: *const crate::cty::c_uchar,
        tbslen: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestSignInit(
        ctx: *mut EVP_MD_CTX,
        pctx: *mut *mut EVP_PKEY_CTX,
        type_: *const EVP_MD,
        e: *mut ENGINE,
        pkey: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestSignFinal(
        ctx: *mut EVP_MD_CTX,
        sigret: *mut crate::cty::c_uchar,
        siglen: *mut size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestVerifyInit(
        ctx: *mut EVP_MD_CTX,
        pctx: *mut *mut EVP_PKEY_CTX,
        type_: *const EVP_MD,
        e: *mut ENGINE,
        pkey: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DigestVerifyFinal(
        ctx: *mut EVP_MD_CTX,
        sig: *const crate::cty::c_uchar,
        siglen: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_OpenInit(
        ctx: *mut EVP_CIPHER_CTX,
        type_: *const EVP_CIPHER,
        ek: *const crate::cty::c_uchar,
        ekl: crate::cty::c_int,
        iv: *const crate::cty::c_uchar,
        priv_: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_OpenFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_SealInit(
        ctx: *mut EVP_CIPHER_CTX,
        type_: *const EVP_CIPHER,
        ek: *mut *mut crate::cty::c_uchar,
        ekl: *mut crate::cty::c_int,
        iv: *mut crate::cty::c_uchar,
        pubk: *mut *mut EVP_PKEY,
        npubk: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_SealFinal(
        ctx: *mut EVP_CIPHER_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_ENCODE_CTX_new() -> *mut EVP_ENCODE_CTX;
}
extern "C" {
    pub fn EVP_ENCODE_CTX_free(ctx: *mut EVP_ENCODE_CTX);
}
extern "C" {
    pub fn EVP_ENCODE_CTX_copy(
        dctx: *mut EVP_ENCODE_CTX,
        sctx: *mut EVP_ENCODE_CTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_ENCODE_CTX_num(ctx: *mut EVP_ENCODE_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncodeInit(ctx: *mut EVP_ENCODE_CTX);
}
extern "C" {
    pub fn EVP_EncodeUpdate(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_EncodeFinal(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    );
}
extern "C" {
    pub fn EVP_EncodeBlock(
        t: *mut crate::cty::c_uchar,
        f: *const crate::cty::c_uchar,
        n: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecodeInit(ctx: *mut EVP_ENCODE_CTX);
}
extern "C" {
    pub fn EVP_DecodeUpdate(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
        in_: *const crate::cty::c_uchar,
        inl: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecodeFinal(
        ctx: *mut EVP_ENCODE_CTX,
        out: *mut crate::cty::c_uchar,
        outl: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_DecodeBlock(
        t: *mut crate::cty::c_uchar,
        f: *const crate::cty::c_uchar,
        n: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_new() -> *mut EVP_CIPHER_CTX;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_reset(c: *mut EVP_CIPHER_CTX) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_free(c: *mut EVP_CIPHER_CTX);
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_key_length(
        x: *mut EVP_CIPHER_CTX,
        keylen: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_set_padding(
        c: *mut EVP_CIPHER_CTX,
        pad: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_ctrl(
        ctx: *mut EVP_CIPHER_CTX,
        type_: crate::cty::c_int,
        arg: crate::cty::c_int,
        ptr: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_CTX_rand_key(
        ctx: *mut EVP_CIPHER_CTX,
        key: *mut crate::cty::c_uchar,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn BIO_f_md() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_base64() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_cipher() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_f_reliable() -> *const BIO_METHOD;
}
extern "C" {
    pub fn BIO_set_cipher(
        b: *mut BIO,
        c: *const EVP_CIPHER,
        k: *const crate::cty::c_uchar,
        i: *const crate::cty::c_uchar,
        enc: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_md_null() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_md4() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_md5() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_md5_sha1() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_blake2b512() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_blake2s256() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha1() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha224() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha256() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha384() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha512() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha512_224() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha512_256() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha3_224() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha3_256() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha3_384() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sha3_512() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_shake128() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_shake256() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_ripemd160() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_whirlpool() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_sm3() -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_enc_null() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_desx_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_des_ede3_wrap() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc4() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc4_40() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc4_hmac_md5() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_40_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_64_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_rc2_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_bf_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_bf_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_bf_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_bf_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_cast5_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_cast5_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_cast5_cfb64() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_cast5_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_xts() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_wrap() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_wrap_pad() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_ocb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_wrap() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_wrap_pad() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_192_ocb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_xts() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_wrap() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_wrap_pad() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_ocb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cbc_hmac_sha1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cbc_hmac_sha1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_128_cbc_hmac_sha256() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aes_256_cbc_hmac_sha256() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_128_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_192_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_gcm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_aria_256_ccm() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_128_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_192_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_cfb1() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_cfb8() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_camellia_256_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_chacha20() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_chacha20_poly1305() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_seed_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_seed_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_seed_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_seed_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_sm4_ecb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_sm4_cbc() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_sm4_cfb128() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_sm4_ofb() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_sm4_ctr() -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_add_cipher(cipher: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_add_digest(digest: *const EVP_MD) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_get_cipherbyname(name: *const crate::cty::c_char) -> *const EVP_CIPHER;
}
extern "C" {
    pub fn EVP_get_digestbyname(name: *const crate::cty::c_char) -> *const EVP_MD;
}
extern "C" {
    pub fn EVP_CIPHER_do_all(
        fn_: ::core::option::Option<
            unsafe extern "C" fn(
                ciph: *const EVP_CIPHER,
                from: *const crate::cty::c_char,
                to: *const crate::cty::c_char,
                x: *mut crate::cty::c_void,
            ),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn EVP_CIPHER_do_all_sorted(
        fn_: ::core::option::Option<
            unsafe extern "C" fn(
                ciph: *const EVP_CIPHER,
                from: *const crate::cty::c_char,
                to: *const crate::cty::c_char,
                x: *mut crate::cty::c_void,
            ),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn EVP_MD_do_all(
        fn_: ::core::option::Option<
            unsafe extern "C" fn(
                ciph: *const EVP_MD,
                from: *const crate::cty::c_char,
                to: *const crate::cty::c_char,
                x: *mut crate::cty::c_void,
            ),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn EVP_MD_do_all_sorted(
        fn_: ::core::option::Option<
            unsafe extern "C" fn(
                ciph: *const EVP_MD,
                from: *const crate::cty::c_char,
                to: *const crate::cty::c_char,
                x: *mut crate::cty::c_void,
            ),
        >,
        arg: *mut crate::cty::c_void,
    );
}
extern "C" {
    pub fn EVP_PKEY_decrypt_old(
        dec_key: *mut crate::cty::c_uchar,
        enc_key: *const crate::cty::c_uchar,
        enc_key_len: crate::cty::c_int,
        private_key: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_encrypt_old(
        enc_key: *mut crate::cty::c_uchar,
        key: *const crate::cty::c_uchar,
        key_len: crate::cty::c_int,
        pub_key: *mut EVP_PKEY,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_type(type_: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_id(pkey: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_base_id(pkey: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_bits(pkey: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_security_bits(pkey: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_size(pkey: *mut EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_set_type(pkey: *mut EVP_PKEY, type_: crate::cty::c_int) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_set_type_str(
        pkey: *mut EVP_PKEY,
        str_: *const crate::cty::c_char,
        len: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_set_alias_type(
        pkey: *mut EVP_PKEY,
        type_: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_set1_engine(pkey: *mut EVP_PKEY, e: *mut ENGINE) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_assign(
        pkey: *mut EVP_PKEY,
        type_: crate::cty::c_int,
        key: *mut crate::cty::c_void,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get0(pkey: *const EVP_PKEY) -> *mut crate::cty::c_void;
}
extern "C" {
    pub fn EVP_PKEY_get0_hmac(
        pkey: *const EVP_PKEY,
        len: *mut size_t,
    ) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_PKEY_get0_poly1305(
        pkey: *const EVP_PKEY,
        len: *mut size_t,
    ) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_PKEY_get0_siphash(
        pkey: *const EVP_PKEY,
        len: *mut size_t,
    ) -> *const crate::cty::c_uchar;
}
extern "C" {
    pub fn EVP_PKEY_set1_RSA(pkey: *mut EVP_PKEY, key: *mut rsa_st) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get0_RSA(pkey: *mut EVP_PKEY) -> *mut rsa_st;
}
extern "C" {
    pub fn EVP_PKEY_get1_RSA(pkey: *mut EVP_PKEY) -> *mut rsa_st;
}
extern "C" {
    pub fn EVP_PKEY_set1_DSA(pkey: *mut EVP_PKEY, key: *mut dsa_st) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get0_DSA(pkey: *mut EVP_PKEY) -> *mut dsa_st;
}
extern "C" {
    pub fn EVP_PKEY_get1_DSA(pkey: *mut EVP_PKEY) -> *mut dsa_st;
}
extern "C" {
    pub fn EVP_PKEY_set1_DH(pkey: *mut EVP_PKEY, key: *mut dh_st) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get0_DH(pkey: *mut EVP_PKEY) -> *mut dh_st;
}
extern "C" {
    pub fn EVP_PKEY_get1_DH(pkey: *mut EVP_PKEY) -> *mut dh_st;
}
extern "C" {
    pub fn EVP_PKEY_set1_EC_KEY(pkey: *mut EVP_PKEY, key: *mut ec_key_st) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get0_EC_KEY(pkey: *mut EVP_PKEY) -> *mut ec_key_st;
}
extern "C" {
    pub fn EVP_PKEY_get1_EC_KEY(pkey: *mut EVP_PKEY) -> *mut ec_key_st;
}
extern "C" {
    pub fn EVP_PKEY_new() -> *mut EVP_PKEY;
}
extern "C" {
    pub fn EVP_PKEY_up_ref(pkey: *mut EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_free(pkey: *mut EVP_PKEY);
}
extern "C" {
    pub fn d2i_PublicKey(
        type_: crate::cty::c_int,
        a: *mut *mut EVP_PKEY,
        pp: *mut *const crate::cty::c_uchar,
        length: crate::cty::c_long,
    ) -> *mut EVP_PKEY;
}
extern "C" {
    pub fn i2d_PublicKey(a: *mut EVP_PKEY, pp: *mut *mut crate::cty::c_uchar) -> crate::cty::c_int;
}
extern "C" {
    pub fn d2i_PrivateKey(
        type_: crate::cty::c_int,
        a: *mut *mut EVP_PKEY,
        pp: *mut *const crate::cty::c_uchar,
        length: crate::cty::c_long,
    ) -> *mut EVP_PKEY;
}
extern "C" {
    pub fn d2i_AutoPrivateKey(
        a: *mut *mut EVP_PKEY,
        pp: *mut *const crate::cty::c_uchar,
        length: crate::cty::c_long,
    ) -> *mut EVP_PKEY;
}
extern "C" {
    pub fn i2d_PrivateKey(a: *mut EVP_PKEY, pp: *mut *mut crate::cty::c_uchar)
        -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_copy_parameters(to: *mut EVP_PKEY, from: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_missing_parameters(pkey: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_save_parameters(
        pkey: *mut EVP_PKEY,
        mode: crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_cmp_parameters(a: *const EVP_PKEY, b: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_cmp(a: *const EVP_PKEY, b: *const EVP_PKEY) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_print_public(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: crate::cty::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_print_private(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: crate::cty::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_print_params(
        out: *mut BIO,
        pkey: *const EVP_PKEY,
        indent: crate::cty::c_int,
        pctx: *mut ASN1_PCTX,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get_default_digest_nid(
        pkey: *mut EVP_PKEY,
        pnid: *mut crate::cty::c_int,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_set1_tls_encodedpoint(
        pkey: *mut EVP_PKEY,
        pt: *const crate::cty::c_uchar,
        ptlen: size_t,
    ) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_PKEY_get1_tls_encodedpoint(
        pkey: *mut EVP_PKEY,
        ppt: *mut *mut crate::cty::c_uchar,
    ) -> size_t;
}
extern "C" {
    pub fn EVP_CIPHER_type(ctx: *const EVP_CIPHER) -> crate::cty::c_int;
}
extern "C" {
    pub fn EVP_CIPHER_param_to_asn1(
        c: *mut EVP_CIPHER_CTX,
        type_: *mut ASN1_TYPE,
